<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Callejero</h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;A trav&eacute;s del callejero este m&oacute;dulo permite realizar
b&uacute;squedas de los n&uacute;meros de polic&iacute;a y de las v&iacute;as ya existentes en el sistema
de LocalGIS.</p>
    <div align="center"><img src="./img/Callejero1.jpg"></div>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;A trav&eacute;s de este panel se podr&aacute;n realizar b&uacute;squedas
de las v&iacute;as o de los n&uacute;meros de polic&iacute;a. Hay dos modos de funcionamiento Manual
y Autom&aacute;tico, que contiene a su vez dos opciones que son Like y Literal.</p>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;El modo de funcionamiento por defecto es el
Autom&aacute;tico, cuando el usuario seleccione una de las operaciones del panel
superior realizar&aacute; una b&uacute;squeda autom&aacute;tica de la v&iacute;a o n&uacute;mero de polic&iacute;a, seg&uacute;n
la operaci&oacute;n que se haya seleccionado. Si la operaci&oacute;n se refiere a una v&iacute;a la
b&uacute;squeda se realizar&aacute; atendiendo al nombre de la v&iacute;a, y si la operaci&oacute;n se
refiere a un n&uacute;mero de polic&iacute;a, la b&uacute;squeda se realizar&aacute; empleando el n&uacute;mero
del portal y el nombre de la v&iacute;a a la que pertenece.</p>

  <br><div align="center"><img src="./img/Callejero2.jpg"><br></div>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;El otro modo de
funcionamiento es el Manual, para activarlo habr&aacute; que seleccionar el bot&oacute;n
correspondiente del panel, una vez hecho esto se activar&aacute; el combo de selecci&oacute;n
de Servicios que permitir&aacute; seleccionar si la b&uacute;squeda que se va a realizar es
de una v&iacute;a o de un n&uacute;mero de polic&iacute;a. Dependiendo del servicio que se haya
seleccionado, se activar&aacute; el campo de texto de nombre de la v&iacute;a y/o del portal.
Si el servicio seleccionado es el b&uacute;squeda de una v&iacute;a, &uacute;nicamente se activar&aacute;
el campo de texto que hace referencia al nombre de la v&iacute;a, mientras que si el
servicio seleccionado es el de b&uacute;squeda de un n&uacute;mero de polic&iacute;a, se activar&aacute;n
los campos de texto de Portal y V&iacute;a, de manera que se pueda introducir el
n&uacute;mero del portal y el nombre de la v&iacute;a donde se encuentra.</p>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;Las opciones de b&uacute;squeda
existentes son Like y Literal, dependiendo de la opci&oacute;n que se haya
seleccionado se mostrar&aacute;n los resultados que coincidan exactamente con el texto
introducido (opci&oacute;n literal) o mostrar&aacute; aquellos que contengan el texto de
b&uacute;squeda pero donde el texto completo es diferente (opci&oacute;n Like).</p>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;Por &uacute;ltimo dependiendo de si
se encuentra activada o no la opci&oacute;n Res. Geom. (Restricci&oacute;n Geom&eacute;trica), las
b&uacute;squedas de las v&iacute;as y de los n&uacute;meros de polic&iacute;a se restringir&aacute;n &uacute;nicamente a
la zona del mapa visualizada en la aplicaci&oacute;n y si no est&aacute; marcada, se realizar&aacute;n
en todo el mapa sin atender a ninguna restricci&oacute;n geom&eacute;trica.</p>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;Una vez se haya realizado la
b&uacute;squeda se mostrar&aacute;n los resultados hasta un m&aacute;ximo de 50 coincidencias, de
manera que si a&uacute;n as&iacute; no se ha encontrado la entidad buscada habr&aacute; que afinar
m&aacute;s la b&uacute;squeda a trav&eacute;s de las distintas opciones.</p>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;Si se selecciona alguno de los resultados de la lista, se mostrar&aacute;n los
datos en el panel de la derecha, de manera que se pueda determinar si se trata
o no de la entidad buscada.</p>

  <br><div align="center"><img src="./img/Callejero3.jpg"><br></div>

  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;Una vez seleccionado uno de los resultados de la
lista si se pulsa el bot&oacute;n Centrar, el mapa que se encuentra a la derecha de la
aplicaci&oacute;n se centrar&aacute; en la entidad seleccionada, apareciendo &eacute;sta marcada en
rojo.</p>
  <br><div align="center"><img src="./img/Callejero4.jpg"><br></div>
</body>
</html>
