<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Datos</h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En este panel se muestran
todos los datos alfanum&eacute;ricos que contiene cada una de las operaciones
realizadas desde la aplicaci&oacute;n Avanza Local Padr&oacute;n.</p>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cada vez que se seleccione una de las operaciones de la tabla se cargar&aacute;
la operaci&oacute;n correspondiente que se haya seleccionado, mostrado la informaci&oacute;n
alfanum&eacute;rica propia de cada tipo de entidad a la que hace referencia la
operaci&oacute;n.</p>

<p class="contenidonormal">Para cada uno de los tipos de entidad existentes
habr&aacute; un conjunto distinto de campos en la informaci&oacute;n alfanum&eacute;rica mostrada.</p>

    <br><div align="center"><img src="./img/Datos.jpg" ><br><br></div>
<p class="contenidonormal">Para los N&uacute;meros de Polic&iacute;a
los campos de informaci&oacute;n son:</p>
<div class="contenidonormal">
<ul>
	<li>Identificador de LocalGIS: identificador que posee el n&uacute;mero de polic&iacute;a en la plataforma de LocalGIS.</li><br>
	<li>Identificador de ALP: identificador del n&uacute;mero de polic&iacute;a en la plataforma Avanza Local Padr&oacute;n.</li><br>
	<li>R&oacute;tulo: campo de la aplicaci&oacute;n LocalGIS mediante el cual se identifican a cada uno de los
portales (ejemplo: 2 D). Este campo es equivalente a la composici&oacute;n de los
campos Calificador y N&uacute;mero, de ALP.</li><br>
	<li>Calificador: campo que indica la letra del portal o n&uacute;mero de polic&iacute;a. Este campo es propio
del sistema de identificaci&oacute;n de los n&uacute;meros de polic&iacute;a en la plataforma ALP.</li><br>
	<li>N&uacute;mero: campo que identifica el n&uacute;mero del portal o n&uacute;mero de polic&iacute;a. Este campo es propio
del sistema de identificaci&oacute;n de los n&uacute;meros de polic&iacute;a en la plataforma ALP.</li><br>
	<li>Identificador de la V&iacute;a: campo que indica el identificador de la v&iacute;a en la que se encuentra el portal.</li><br>
	<li>Tipo de la V&iacute;a: indica el tipo de la v&iacute;a en la que se encuentra el portal.</li><br>
	<li>Nombre de la V&iacute;a: muestra el nombre de la v&iacute;a en la que se encuentra el n&uacute;mero de polic&iacute;a.</li><br>
	<li>Fecha de Ejecuci&oacute;n: fecha en la se ha realizada la operaci&oacute;n que se muestra.</li><br>
</ul>
</div>

    <br><div align="center"><img src="./img/Datos2.jpg" ></div>

<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp; Para las V&iacute;as los campos de informaci&oacute;n son:</p>

<div class="contenidonormal">
<ul>
	<li>Identificador de LocalGIS: identificador de la v&iacute;a en el sistema de LocalGIS</li><br>
	<li>Identificador de ALP: identificador de la v&iacute;a en la aplicaci&oacute;n de ALP.</li><br>
	<li>Tipo de la V&iacute;a: tipo de la v&iacute;a</li><br>
	<li>Nombre de la V&iacute;a: nombre de la v&iacute;a, este nombre es el dado por el INE.</li><br>
	<li>C&oacute;digo: c&oacute;digo INE de la v&iacute;a.</li><br>
	<li>Fecha de Grabaci&oacute;n y de Cierre: fecha de Grabaci&oacute;n y de Cierre.</li><br>
	<li>Fecha de Grabaci&oacute;n del Ayuntamiento: fecha de grabaci&oacute;n del ayuntamiento.</li><br>
	<li>Fecha de Ejecuci&oacute;n: fecha de ejecuci&oacute;n de la operaci&oacute;n.</li><br>
</ul>
</div>
</div>
</body>
</html>
