<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Operaciones de Sincronizaci&oacute;n<br></h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Las operaciones de
sincronizaci&oacute;n que se pueden realizar en la aplicaci&oacute;n son las mismas que se
muestran en el panel Operaciones ALP y son: </p>

<div class="contenidonormal">
<ul>
<li><b>Alta Callejero</b>: consiste en a&ntilde;adir una nueva calle en el sistema. Para ello primero se
tiene que dibujar una calle en el mapa.</p>

<p>Empleando las herramientas de edici&oacute;n del editor se dibujar&aacute; una nueva
v&iacute;a en el mapa empleando para ello una capa auxiliar y se seleccionar&aacute; la
entidad dibujada en el mapa.</p><br>

    <div align="center"><img src="./img/Sincronizar1.jpg"></div><br>

<p class="contenidonormal">Para
realizar la operaci&oacute;n se tiene que tener seleccionada en la tabla del panel
Operaciones ALP la operaci&oacute;n de Alta Callejero que se quiere realizar, de esta
manera se habilitar&aacute;n los botones de Sincronizar y Eliminar, siempre que el
usuario que est&aacute; ejecutando esta herramienta tenga permisos para realizar estas
operaciones.</p>

<p>Una vez se tenga seleccionada la entidad y la operaci&oacute;n a realizar, se
pulsar&aacute; en el bot&oacute;n Sincronizar y se a&ntilde;adir&aacute; la nueva entidad a la capa Calles,
a&ntilde;adiendo la nueva v&iacute;a en el sistema de LocalGIS.</p>

<li><b>Alta Numerero: </b>consiste en a&ntilde;adir un nuevo n&uacute;mero de polic&iacute;a al sistema.</li>

<p>Primero se
tiene que dibujar el n&uacute;mero de polic&iacute;a que se desee a&ntilde;adir empleando para ello
una capa auxiliar y no la capa N&uacute;meros de polic&iacute;a, ya que &eacute;sta se encuentra
como no editable.</p>

<br>

  <div align="center"><img src="./img/Sincronizar2.jpg"><br><br></div>

<p >Para realizar la operaci&oacute;n
de alta, se tiene que tener seleccionada la nueva entidad y la operaci&oacute;n de
alta numerero a realizar que se encuentra en la tabla del panel Operaciones ALP,
de esta manera se habilitar&aacute; el bot&oacute;n Sincronizar y tras pulsar &eacute;ste se a&ntilde;adir&aacute;
la nueva entidad a la capa N&uacute;meros de polic&iacute;a del sistema.</p>

<li><b>Baja Callejero</b>: consiste en eliminar
una de las v&iacute;as presentes en el sistema. Una vez se haya seleccionado la operaci&oacute;n
de baja de la tabla del panel Operaciones ALP, se realizar&aacute; una b&uacute;squeda
autom&aacute;tica que ayudar&aacute; a la localizaci&oacute;n de la entidad en el sistema, en caso
de que entre los resultados mostrados no se encuentre el resultado deseado,
habr&aacute; que realizar una b&uacute;squeda manual. Una vez se haya localizado la v&iacute;a habr&aacute;
que seleccionar esta en el mapa, hay que asegurarse que se haya seleccionado
una &uacute;nica entidad perteneciente a la capa Calles. Una vez seleccionada la
entidad y siempre que se tenga seleccionada la operaci&oacute;n de baja, habr&aacute; que
pulsar sobre el bot&oacute;n Sincronizar, de esta manera la V&iacute;a se eliminar&aacute; del sistema
pudiendo visualizarse el resultado en el mapa.</li><br>

<li><b>Baja Numerero</b>: consiste en eliminar
uno de los n&uacute;meros de polic&iacute;a existentes en el sistema. Una vez se tienen
seleccionada la operaci&oacute;n de baja de numerero que se desea realizar en la tabla
del panel Operaciones ALP, se realizar&aacute; una b&uacute;squeda autom&aacute;tica que ayudar&aacute; a
la localizaci&oacute;n de la entidad en el sistema, en caso de que entre los
resultados mostrados no se encuentre el resultado deseado, habr&aacute; que realizar
una b&uacute;squeda manual. Una vez se haya localizado el n&uacute;mero de polic&iacute;a que se
desea dar de baja habr&aacute; que seleccionarlo, hay que asegurarse de que la entidad
seleccionada sea una &uacute;nica entidad y que pertenezca a la capa N&uacute;meros de
polic&iacute;a. Teniendo seleccionada la entidad y la operaci&oacute;n de baja
correspondiente habr&aacute; que pulsar el bot&oacute;n Sincronizar de manera que se
eliminar&aacute; el n&uacute;mero de polic&iacute;a del sistema, pudiendo visualizar el resultado en
el mapa de la aplicaci&oacute;n.</li><br>

<li><b>Modificaci&oacute;n Callejero</b>: consiste en
modificar los datos de una de las v&iacute;as existentes en el sistema, se modificar&aacute;n
los datos provenientes de la aplicaci&oacute;n Avanza Local Padr&oacute;n, datos que se
almacenar&aacute;n en LocalGIS. </li>

<p>Una vez se haya seleccionado
la operaci&oacute;n de modificaci&oacute;n de la tabla del panel Operaciones ALP, se
realizar&aacute; una b&uacute;squeda autom&aacute;tica que ayudar&aacute; a la localizaci&oacute;n de la entidad
en el sistema. En el caso de que entre los resultados mostrados no se encuentre
el deseado, habr&aacute; que realizar una b&uacute;squeda manual. Una vez se haya localizado
la v&iacute;a habr&aacute; que seleccionar &eacute;sta en el mapa, hay que asegurarse que se haya
seleccionado una &uacute;nica entidad perteneciente a la capa Calles. Una vez
seleccionada la entidad y siempre que se tenga seleccionada la operaci&oacute;n de modificaci&oacute;n,
habr&aacute; que pulsar sobre el bot&oacute;n Sincronizar, de esta manera la v&iacute;a seleccionada
se modificar&aacute; guardando los datos alfanum&eacute;ricos existentes en la operaci&oacute;n.</p>

<li><b>Modificaci&oacute;n Numerero</b>: consiste en
modificar los datos de uno de los portales o n&uacute;meros de polic&iacute;a existentes en
el sistema, se modificar&aacute;n los datos provenientes de la aplicaci&oacute;n Avanza Local
Padr&oacute;n, datos que se almacenar&aacute;n en LocalGIS.</p>

<p>Una vez se haya seleccionado
la operaci&oacute;n de modificaci&oacute;n de la tabla del panel Operaciones ALP, se
realizar&aacute; una b&uacute;squeda autom&aacute;tica que ayudar&aacute; a la localizaci&oacute;n de la entidad
en el sistema. En el caso de que entre los resultados mostrados no se encuentre
el deseado, habr&aacute; que realizar una b&uacute;squeda manual. Una vez se haya localizado
el portal habr&aacute; que seleccionar &eacute;ste en el mapa, hay que asegurarse que se haya
seleccionado una &uacute;nica entidad perteneciente a la capa N&uacute;meros de polic&iacute;a. Una
vez seleccionada la entidad y siempre que se tenga seleccionada la operaci&oacute;n de
modificaci&oacute;n, habr&aacute; que pulsar sobre el bot&oacute;n Sincronizar, de esta manera el
portal o n&uacute;mero de polic&iacute;a seleccionado se modificar&aacute; guardando los datos
alfanum&eacute;ricos existentes en la operaci&oacute;n.</p>

<p>Si se pulsa el bot&oacute;n Eliminar cuando
se tiene seleccionada una de las operaciones ALP de la tabla correspondiente,
se eliminar&aacute; esta opci&oacute;n de la lista de operaciones a realizar. Adem&aacute;s hay que
tener en cuenta que s&oacute;lo se pueden eliminar operaciones ALP y realizar la
sincronizaci&oacute;n de las operaciones ALP si el usuario posee el permiso
correspondiente.</p>
</li>
</ul>

</div>
</body>
</html>
