<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Herramientas de edici&oacute;n. Gesti&oacute;n de coordenadas absolutas y  relativas </h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta herramienta permitir&aacute; trabajar con coordenadas absolutas adem&aacute;s de con  coordenadas relativas.&nbsp; Forma parte de  las herramientas de dibujo existentes en GEOPISTA.&nbsp; Los iconos de las distintas herramientas de  edici&oacute;n que emplean esta utilidad son: <img src="./img/iconopoligono.gif" alt="1" width="24" height="24">, <img src="./img/iconolinea.gif" alt="2" width="24" height="24">, <img src="./img/iconopunto.gif" alt="3" width="24" height="24">&nbsp;y <img src="./img/iconoseleccionpoligono.gif" alt="4" width="25" height="25">.<br>
  &nbsp;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Al pulsar sobre  cualquiera de estos iconos aparecer&aacute; en el panel de las herramientas de edici&oacute;n  dos cajas de texto, una hace referencia a la coordenada X y otra a la  coordenada Y del mapa. </p>
  <div align="center"><img src="./img/panelpoligono.jpg" alt="5" width="130" height="316">
      </p>
  </div>
  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Por defecto estas cajas hacen referencia a las coordenadas absolutas del  mapa, pero si se marca la casilla &ldquo;Coord. Relativas&rdquo; de este panel, har&aacute;n  referencia a las coordenadas relativas a un punto.</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Con el modo de funcionamiento en coordenadas absolutas, si&nbsp; se desplaza el cursor en la zona del mapa, se  indicar&aacute; en los cuadros de texto las coordinas X e Y sobre las que se encuentra  el cursor en el mapa. Sin embargo si habilita la opci&oacute;n de coordenadas  relativas, se mostrar&aacute;n las coordenadas relativas al &uacute;ltimo punto dibujado en  el mapa por la herramienta que contiene esta utilidad.</p>
<p align="center"><img src="./img/ejemplodibujar.jpg" alt="6" width="612" height="459"></p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Permite adem&aacute;s introducir los puntos a dibujar a trav&eacute;s de estos cuadros de  texto, de manera que se puede introducir cada uno de los puntos escribiendo las  coordenadas deseadas en estos recuadros y pulsando el bot&oacute;n de Intro del  teclado. Para introducir el &uacute;ltimo punto que determina el final del proceso de  dibujo de la nueva entidad hay que pulsar el bot&oacute;n de Intro pero manteniendo  pulsado en bot&oacute;n Ctrl del teclado. Este modo de inserci&oacute;n de los puntos se le  indica al usuario a trav&eacute;s de la barra de estado.</p>
    <div align="center"><img src="./img/edicionparametros.jpg" alt="7" width="411" height="464">
        </p>
    </div>
    <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Adem&aacute;s se pueden alternar los puntos fijados en el mapa a trav&eacute;s del rat&oacute;n  y a trav&eacute;s de los cuadros de texto del panel de herramientas de edici&oacute;n,  dotando a las herrmientas de dibujo de una mayor flexibilidad.</p>
<p align="center"><img src="./img/ejemplodibujarfin.jpg" alt="8" width="595" height="446"></p>

</body>

</html>
