<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro" >Herramientas de edici&oacute;n. Girado de elementos</h1>
<ul>
  <li>
    <div align="justify" class="contenidonormal" >
      <div align="left"><img src="./img/iconogirado.gif" alt="1" width="27" height="25">&nbsp;Herramienta de girado de elementos</div>
    </div>
  </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Con una o varias entidades seleccionadas, esta herramienta permite realizar  giros respecto al centro geom&eacute;trico de la misma o con respecto a un punto de  referencia que seleccione el usuario. Consta de un &uacute;nico bot&oacute;n dentro del panel  de herramientas de edici&oacute;n <img src="./img/iconoedicion.gif" alt="2" width="24" height="24">, con el siguiente aspecto: <img src="./img/iconogiradopequenio.gif" alt="3" width="20" height="20"></p>
<p align="center"><img src="./img/ejemplogirado.jpg" alt="4" width="598" height="449"></p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta opci&oacute;n estar&aacute; accesible para todos los usuarios del editor GIS.<br>
  &nbsp;<br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El usuario seleccionar&aacute; la entidad o conjunto de entidades que desea girar  dentro de una capa editable desde las herramientas de edici&oacute;n de GeoPISTA.<br>
  <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Posteriormente el usuario seleccionar&aacute; la herramienta de Rotaci&oacute;n del men&uacute;  de Edici&oacute;n de GeoPISTA, pulsar&aacute; sobre la zona de edici&oacute;n y arrastrando el rat&oacute;n  en un sentido u otro se realizar&aacute; el girado de la selecci&oacute;n..<br>
  La entidad o entidades giran en el sentido del movimiento del rat&oacute;n. Hay  dos modos de giro que son:</p>
<ul>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Respecto al  centro geom&eacute;trico de la selecci&oacute;n. </div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Respecto a un  punto seleccionado. Este punto se seleccionar&aacute;, una vez se haya pulsado en la  herramienta de girado, pulsando en un punto de alguna de las entidades  presentes en el mapa, independientemente de la geometr&iacute;a que tengan. Adem&aacute;s se  puede introducir el &aacute;ngulo de giro a trav&eacute;s de la caja de texto que aparece en  el panel de la caja de herramientas.</div>
    </div>
  </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Existen dos manera de introducir el &aacute;ngulo de giro de las entidades seleccionadas:</p>
<ul>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Arrastrando  el rat&oacute;n por la pantalla en el sentido en el que se quiere realizar el giro. El  &aacute;ngulo del giro se indicar&aacute; en la barra de estado del GIS. Se realizar&aacute; el giro  una vez que el usuario haya soltado el bot&oacute;n del rat&oacute;n.</div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Introduciendo  el &aacute;ngulo exacto en la caja de texto que se encuentra al final de la caja de  edici&oacute;n. Las variaciones del giro se ir&aacute;n mostrando en el mapa, y s&oacute;lo se  finalizar&aacute; la operaci&oacute;n girando las entidades seleccionadas si se pulsa el  bot&oacute;n de Intro del teclado.</div>
    </div>
  </li>
</ul>
<div align="justify" class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
  <div align="left">Para que esta herramienta realice el giro, las  capas de las entidades seleccionadas tienen que ser editables, en caso  contrario se mostrar&aacute; un mensaje de aviso en la barra de estado </div>
</div>
</body>
</html>
