<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>IMPORTAR FICHERO INFORMÁTICO DE CATASTRO URBANA</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P><A NAME="_Toc85603327"><A NAME="_Toc85432208">IMPORTAR </A>FICHERO INFORM&Aacute;TICO DE CATASTRO URBANA</A></P>
<P><A NAME="_Toc85603328"><A NAME="_Toc85432209">Selecci&oacute;n del fichero</A></A></P>
</B></U><P>&nbsp;</P>
<P>Esta pantalla, le permite al usuario importar el FINURB (Fichero Inform&aacute;tico de Catastro Urbana), proporcionado por la Direcci&oacute;n General de Catastro que desea incorporar en la base de datos del sistema.</P>
<P>El usuario podr&aacute; seleccionar archivos de tipo ".txt", para proceder a la importaci&oacute;n de los datos de los Inmuebles Urbanos.</P>
<P>El usuario deber&aacute; tener el permiso de "Importar FINURB", para poder seleccionar el fichero y continuar con la importaci&oacute;n. De lo contrario el bot&oacute;n de Abrir aparecer&aacute; desactivado, y el usuario no podr&aacute; realizar ninguna acci&oacute;n en esta pantalla.</P>
<P>Una vez seleccionado el fichero a importar, el sistema validar&aacute; la informaci&oacute;n y la intentar&aacute; cargar en la base de datos del sistema. </P>
<P>Si el sistema encuentra errores o discrepancias en la informaci&oacute;n, imprime un mensaje de error y no importar&aacute; ninguna informaci&oacute;n para mantener la integridad del sistema. </P>
</FONT><P><IMG SRC="Image81.gif" WIDTH=564 HEIGHT=437></P>
<FONT FACE="Verdana"><P>&nbsp;</P>
<P>Si por el contrario, no se encuentra ning&uacute;n error se guardar&aacute; toda la informaci&oacute;n en la base de datos e imprimir&aacute; un mensaje diciendo que la operaci&oacute;n se ha realizado con &eacute;xito.</P>
</FONT><P><IMG SRC="Image82.gif" WIDTH=564 HEIGHT=438></P>
<B><U><FONT FACE="Verdana"><P ALIGN="JUSTIFY"><A NAME="_Toc85603329">Fin de la importaci&oacute;n</A></P>
</B></U></FONT><PRE>&nbsp;</PRE>
<FONT FACE="Verdana"><P ALIGN="JUSTIFY">Pulsando en bot&oacute;n siguiente, finalizar&aacute; el proceso de importaci&oacute;n, indicando la fecha y hora en que se ha realizado la importaci&oacute;n, nº de registros sobre parcelas, subparcelas, unidades constructivas, cargos y titulares importados...</P>
<P ALIGN="JUSTIFY">&nbsp;</P>
</FONT><P ALIGN="JUSTIFY"><IMG SRC="Image83.gif" WIDTH=563 HEIGHT=436></P>
</BODY>
</HTML>
