<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080">
<DIR>

<B><U><FONT FACE="Verdana"><P><A NAME="_Toc85551999">GENERADOR DE CONSULTAS.</A></P><DIR>

</B></U></FONT><FONT FACE="Verdana" SIZE=3><P>Mediante esta interface se guardar&aacute;n consultas para poder usar posteriormente en filtros.</P>
</FONT><P><IMG SRC="Image54.jpg" WIDTH=564 HEIGHT=564></P>
<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P>En la parte superior aparecer&aacute;n en una lista las consultas que est&aacute;n almacenadas</P>
</FONT><P><IMG SRC="Image55.jpg" WIDTH=238 HEIGHT=92></P>
<FONT FACE="Verdana" SIZE=3><P>Haciendo clic sobre una consulta de la lista anterior se rellenar&aacute; toda la interface con la informaci&oacute;n guardada.</P>
<P>&nbsp;</P>
</FONT><P><IMG SRC="Image56.jpg" WIDTH=564 HEIGHT=564></P></DIR>
</DIR>

<B><U><FONT FACE="Verdana" SIZE=3><P><A NAME="_Toc85552000">Acciones sobre las consultas.</A></P>
</B></U></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P><IMG SRC="Image57.jpg" WIDTH=142 HEIGHT=25></TD>
<TD WIDTH="75%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Limpiar la ventana todos los restos de otras consultas y as&iacute; se podr&aacute; iniciar mejor una nueva consulta. </FONT></TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P><IMG SRC="Image58.jpg" WIDTH=94 HEIGHT=21></TD>
<TD WIDTH="75%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Una vez limpiado la ventana y rellenada la interface de la consulta, se pulsar&aacute; el bot&oacute;n nuevo para guardarla.</FONT></TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P><IMG SRC="Image59.jpg" WIDTH=100 HEIGHT=25></TD>
<TD WIDTH="75%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Elimina una consulta de la lista</FONT></TD>
</TR>
<TR><TD WIDTH="25%" VALIGN="TOP">
<P><IMG SRC="Image60.jpg" WIDTH=107 HEIGHT=25></TD>
<TD WIDTH="75%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>La consulta que se ha modificado en la interface la almacena en disco.</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>Para cada consulta ser&aacute; obligatorio rellenar el <B>Nombre </B>de la consulta que se le dar&aacute;, se establecen verificaciones para no nombrar a dos consultas con el mismo nombre.</P>
<P>&nbsp;</P>
<P>Para el ejemplo se ha cargado de la base de datos, de la tabla provincias los campos correspondientes, el nombre de la tabla se pasa como par&aacute;metro.</P>
</FONT><P><IMG SRC="Image61.jpg" WIDTH=535 HEIGHT=121></P>
<B><FONT FACE="Verdana" SIZE=3><P>Campo</B>: Nombre del campo para establecer la condici&oacute;n</P>
<B><P>Operador</B>: Cada uno de los operadores establecidos para formar la condici&oacute;n</P>
<B><P>Valor</B> : Valor con el que se va a comprar.</P>
<B><P>Uni&oacute;n</B>: Ser&aacute; un enlace con el valor anterior, en condiciones m&uacute;ltiples, estos ser&aacute;n Y o O l&oacute;gicas.</P>
<B><P>Negar condici&oacute;n</B>: Se usar&aacute; para negar condiciones.</P>
<P>&nbsp;</P>
<P>Hay que tener en cuenta que en una condici&oacute;n sencilla de un &uacute;nico valor, no podr&aacute; existir ning&uacute;n enlace con la condici&oacute;n anterior.</P>
<P>Cuando, por el contrario, la condici&oacute;n sea m&uacute;ltiple, a partir de la segunda condici&oacute;n se deber&aacute; incluir el enlace con la condici&oacute;n anterior.</P>
<P>&nbsp;</P>
<P>A medida que se vayan generando las condiciones ir&aacute;n apareciendo en la tabla de la parte inferior de la interface.</P>
<P>&nbsp;</P>
</FONT><P><IMG SRC="Image62.jpg" WIDTH=526 HEIGHT=144></P>
<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>Existen dos botones:</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=631>
<TR><TD WIDTH="11%" VALIGN="TOP">
<P><IMG SRC="Image63.jpg" WIDTH=39 HEIGHT=22></TD>
<TD WIDTH="89%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Nos permite a&ntilde;adir la condici&oacute;n que hemos rellenado a la tabla, para posteriormente guardarla con la consulta.</FONT></TD>
</TR>
<TR><TD WIDTH="11%" VALIGN="TOP">
<P><IMG SRC="Image64.jpg" WIDTH=29 HEIGHT=25></TD>
<TD WIDTH="89%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Permite eliminar una fila seleccionada de la tabla anteriormente comentada.</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P></FONT></BODY>
</HTML>
