<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>GENERAR MAPA DE PLANEAMIENTO</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Arial Narrow"><P><A NAME="_Toc85534523">Generar Mapa de informaci&oacute;n de rerefencia.</A></P>
</B></U></FONT><FONT FACE="Arial"><P>Esta opci&oacute;n imprimir&aacute; el mapa del m&oacute;dulo de Informaci&oacute;n de Referencia que se est&aacute; visualizando en pantalla.</P>
<P>Se realizar&aacute; a trav&eacute;s de un asistente que consta de los siguientes pasos:</P>
<P>&nbsp;</P>
<B><P>Paso 1. Visualizaci&oacute;n del Mapa </P>
</B></FONT><P><IMG SRC="Image218.jpg" WIDTH=817 HEIGHT=652></P>
<FONT FACE="Arial"><P>Se ve el mapa cargado con las capas especificadas para este mapa.</P>
<P>En la parte superior se encuentra la barra de herramientas:</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=631>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image76.gif" WIDTH=27 HEIGHT=28></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Arial"><P>Pinchando y arrastrando sobre el mapa se provoca un zoom a la zona seleccionada.</P>
<P>Haciendo clic con el bot&oacute;n derecho sobre el mapa se provoca un alejamiento </FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image77.gif" WIDTH=30 HEIGHT=29></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Arial"><P>Herramienta para desplazar el plano por la pantalla</FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image78.gif" WIDTH=29 HEIGHT=29></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Arial"><P>Haciendo clic sobre esta herramienta se hace un zoom a la extensi&oacute;n del mapa</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Arial"><P>&nbsp;</P>
<B><P>Paso 2. Datos Generales</P>
</B></FONT><P><IMG SRC="Image113.jpg" WIDTH=564 HEIGHT=331></P>
<FONT FACE="Arial"><P>En este paso se introducir&aacute; el t&iacute;tulo del mapa y una descripci&oacute;n acerca del mapa.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><P>Paso 3. Escala y Leyenda</P>
</B></FONT><P><IMG SRC="Image114.jpg" WIDTH=563 HEIGHT=165></P>
<FONT FACE="Arial"><P>Mediante este panel, se podr&aacute; decidir si se imprime la leyenda activando la casilla de verificaci&oacute;n <B>incluir leyenda</B>.</P>
<P>Se podr&aacute; elegir la escala o vista a la que se imprimir&aacute; el mapa, mediante el cuadro combinado de <B>Seleccionar Escala</P>
<P>Paso 4. Configuraci&oacute;n de Impresora</P>
</B></FONT><P><IMG SRC="Image115.jpg" WIDTH=383 HEIGHT=252></P>
<FONT FACE="Arial"><P>Mediante este panel se podr&aacute;n realizar dos funciones importantes:</P>

<UL>
<LI>Selecci&oacute;n y configuraci&oacute;n de la impresora por la que se va a imprimir el mapa </LI>
<LI>Selecci&oacute;n y configuraci&oacute;n del papel a usar.</LI></UL>

<P>En ambos pasos se usar&aacute;n los cuadro de dialogo definidos por Windows.</P>
<B><P>Paso 5. Previsualizaci&oacute;n del Mapa</P>
</B></FONT><P><IMG SRC="Image219.jpg" WIDTH=563 HEIGHT=508></P>
<FONT FACE="Arial"><P>Se realizar&aacute; una previsualizaci&oacute;n de c&oacute;mo se va a imprimir el mapa, en funci&oacute;n de la escala seleccionada.</P>
<P>Si se pulsa el bot&oacute;n <B>Finalizar</B> se imprimir&aacute; el mapa por la impresora seleccionada y con el papel seleccionado.</P>
<P>En cambio si se pulsa el bot&oacute;n <B>Cancelar</B> no se realizar&aacute; ninguna opci&oacute;n.</P></FONT></BODY>
</HTML>
