<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>IMPORTAR AMBITOS DE GESTIÓN DEL SUELO</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P><A NAME="_Toc85601968">IMPORTAR AMBITOS DE GESTI&Oacute;N DEL SUELO</A></P>
</FONT><FONT FACE="Verdana" SIZE=3><P><A NAME="_Toc85601969">Selecci&oacute;n del fichero</A></P>
</B></U><P>&nbsp;</P>
<P>Cuando el usuario selecciona la opci&oacute;n "Importar Ambitos de Gesti&oacute;n del Suelo " en la pantalla inicial del m&oacute;dulo se abre la pantalla de importaci&oacute;n, donde el usuario puede indicar el fichero a importar.</P>
<P>Esta opci&oacute;n s&oacute;lo est&aacute; disponible para los usuarios con permisos de "Importar Ambitos de Gesti&oacute;n del Suelo". Si el usuario no dispone de estos permisos el bot&oacute;n de "Abrir" aparecer&aacute; desactivado, y el usuario no podr&aacute; continuar en el proceso de importaci&oacute;n de &aacute;mbitos del suelo.</P>
<P>El sistema comprobar&aacute; que el archivo a importar contiene &aacute;mbitos de gesti&oacute;n del suelo que han sido creados con los plug-in para las aplicaciones comerciales.</P>
<P>Solamente se podr&aacute;n seleccionar shapefiles y jml. </P>
<P>&nbsp;</P>
<P>Una vez seleccionado el fichero a importar, el sistema realiza el proceso de validaci&oacute;n para comprobar que el fichero es v&aacute;lido.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Si el fichero seleccionado es v&aacute;lido, el usuario podr&aacute; seguir con el proceso de importaci&oacute;n, pulsando en el bot&oacute;n "Siguiente"</P>
</FONT><P><IMG SRC="Image101.gif" WIDTH=600 HEIGHT=464></P>
<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P>Si el fichero seleccionado no es v&aacute;lido, bien porque no cumple con el esquema especificado, o bien porque aunque cumpla con el esquema hay datos que no son correctos, el usuario no podr&aacute; continuar, y el bot&oacute;n de Siguiente aparecer&aacute; desactivado, hasta que se seleccione otro fichero correcto o pulse en Cancelar para salir de esta pantalla.</P>
<P>&nbsp;</P>
</FONT><P><IMG SRC="Image102.gif" WIDTH=600 HEIGHT=466></P></BODY>
</HTML>
