<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>INFORME DE PARCELAS AFECTADAS POR ÁMBITOS DE GESTIÓN DE SUELO</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana" SIZE=3><P><A NAME="_Toc85534524">Informe de Parcelas Afectadas por &Aacute;mbitos de Gesti&oacute;n de Suelo</A></P>
</B></U><P>Este informe recoger&aacute; un &aacute;mbito de gesti&oacute;n y las parcelas que est&aacute;n afectadas por ese &aacute;mbito de gesti&oacute;n del suelo.</P>
<P>Se lanzar&aacute; la siguiente ventana:</P>
</FONT><P><IMG SRC="Image117.jpg" WIDTH=603 HEIGHT=487></P>
<FONT FACE="Verdana" SIZE=3><P>Se ver&aacute; el plano definido para la opci&oacute;n de &aacute;mbitos de gesti&oacute;n.</P>
<P>Esta ventana contiene la siguiente barra de herramientas:</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=631>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image76.gif" WIDTH=27 HEIGHT=28></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Pinchando y arrastrando sobre el mapa se provoca un zoom a la zona seleccionada.</P>
<P>Haciendo clic con el bot&oacute;n derecho sobre el mapa se provoca un alejamiento </FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image77.gif" WIDTH=30 HEIGHT=29></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Herramienta para desplazar el plano por la pantalla</FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image78.gif" WIDTH=29 HEIGHT=29></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Haciendo clic sobre esta herramienta se hace un zoom a la extensi&oacute;n del mapa</FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image79.gif" WIDTH=27 HEIGHT=27></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>Herramienta para seleccionar un elemento del plano</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>Adem&aacute;s contendr&aacute; el cuadro combinado, que est&aacute; rellenado con todos los &aacute;mbitos de gesti&oacute;n que existieran en la base de datos.</P>
</FONT><P><IMG SRC="Image118.jpg" WIDTH=412 HEIGHT=108></P>
<FONT FACE="Verdana" SIZE=3><P>No se podr&aacute; pasar a la visualizaci&oacute;n del informe, sin que se haya seleccionado un &aacute;mbito de gesti&oacute;n. Para ello se podr&aacute; realizar de dos formas distintas:</P>

<UL>
<LI>Seleccionando un elemento del cuadro combinado, y de forma autom&aacute;tica se provocar&aacute; un zoom en el mapa</LI>
<LI>Haciendo clic con la herramienta de selecci&oacute;n del mapa, indicada anteriormente.</LI></UL>

<P>&nbsp;</P></FONT></BODY>
</HTML>
