<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Comparación de Dominios</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P><A NAME="_Toc85601970">Comparaci&oacute;n de Dominios</A></P>
</B></U></FONT><FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>El sistema compara el rango de valores de los campos principales de las capas de planeamiento con los dominios existentes en el Sistema de Informaci&oacute;n Territorial. En el caso de existir en el dominio del SIT todo el rango de valores el sistema importa la informaci&oacute;n sin intervenci&oacute;n del usuario. El caso que el nuevo rango de valores incorpore alg&uacute;n valor que no exista en el dominio del SIT el sistema muestra esta pantalla: Comparaci&oacute;n de Dominios.</P>
<P>&nbsp;</P>
<P>El cuadro de di&aacute;logo de Comparaci&oacute;n de Dominios de planeamiento se divide en tres cuadros de texto, un combo "Dominio" que muestra la capa de dominios y botones de interacci&oacute;n. En el cuadro rotulado como "Valores nuevos" se muestran todos los nuevos valores que el sistema ha detectado autom&aacute;ticamente durante el proceso de importaci&oacute;n, la capa a la que hacen referencia se muestra en el combo "Dominio" de la parte superior. En el cuadro "Valores existentes" aparecen los valores del mismo dominio que se encuentran almacenados en el SIT. El cuadro "Lista de Incorporaciones" aparecen los valores que el usuario a&ntilde;ade al dominio del SIT.</P>
<P>&nbsp;</P>
<P>El usuario utilizar&aacute; el bot&oacute;n "A&ntilde;adir" para a&ntilde;adir un valor nuevo al SIT. Usar&aacute; el bot&oacute;n "Vincular" si ha seleccionado un registro del cuadro "Valores nuevos" y otro del "Valores existentes" y el sistema vincular&aacute; todos los registros que tengan ese valor del dominio al existente en el SIT como "Valores existentes". El bot&oacute;n "Eliminar" hace que el sistema no importe los registros que tienen ese valor.</P>
<P>&nbsp;</P>
<P>Para realizar estas operaciones es necesario tener los permisos de "Alta de Dominios Planeamiento Municipal" para a&ntilde;adir, "Vincular Dominios Planeamiento Municipal" para vincular y "Eliminar Dominios Planeamiento Municipal" para eliminar. En caso de no tener estos permisos aparecer&aacute;n desactivados los botones, por lo que el usuario podr&aacute; realizar unas u otras acciones.</P>
<P>&nbsp;</P>
<P>El sistema validar&aacute; que el usuario haya ofrecido una soluci&oacute;n para todos los valores nuevos encontrados en el proceso previo de importaci&oacute;n, de no ser as&iacute; no podr&aacute; proceder a la importaci&oacute;n de los registros. Por ello, el bot&oacute;n Siguiente aparece desactivado hasta que no exista ning&uacute;n valor en la lista de Valores Nuevos.</P>
<P>En el cuadro de texto "Lista de incorporaciones", se mostrar&aacute; las acciones que el usuario ha optado por realizar.</P>
<P>&nbsp;</P>
<P>En cualquier momento se puede pulsar sobre el bot&oacute;n "Cancelar" para no modificar estos valores de la base de datos.</P>
</FONT><P><IMG SRC="Image103.gif" WIDTH=600 HEIGHT=464></P>
<FONT FACE="Verdana" SIZE=3><P>Ahora se puede seguir con la importaci&oacute;n porque ya no existen valores nuevos:</P>
</FONT><P><IMG SRC="Image104.gif" WIDTH=600 HEIGHT=465></P></BODY>
</HTML>
