<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Importador del fichero de intercambio de informacion de titularidad</title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h2 class="cabeceraazuloscuro">Importador del Fichero de Intercambio de informaci&oacute;n de  Titularidad</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Empleando esta herramienta los  usuarios podr&aacute;n importar en el sistema la informaci&oacute;n recogida en el fichero de  intercambio de informaci&oacute;n de titularidad, la informaci&oacute;n recogida en el  fichero FIN DE RETORNO o la informaci&oacute;n recogida en el fichero de informaci&oacute;n  de retorno, generados todos ellos por la D. G.  de Catastro. Estos ficheros deber&aacute;n cumplir el esquema y estructura definidos  por la D.G.C. 
  (http://www.catastro.meh.es/esp/colaboradores1.asp#menu4).</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para ejecutar esta herramienta  habr&aacute; que pulsar en la opci&oacute;n <strong>FIN de  retorno masivo</strong> dentro de la opci&oacute;n del men&uacute; <strong>Importaci&oacute;n de Ficheros </strong>(Figura 28). </p>
    <div align="center" class="contenidonormal"><img src="./img/InformacionTitularidad1.jpg" alt="1" width="323" height="181" border="0"><br>
      Figura 28. Selecci&oacute;n en el men&uacute;
      </p>
    </div>
    <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez pulsada esta pesta&ntilde;a del  men&uacute; aparecer&aacute; la ventana que nos permitir&aacute; realizar la importaci&oacute;n del  fichero&nbsp; (Figura 29).</p>
    <div align="center" class="contenidonormal"><img src="./img/InformacionTitularidad2.jpg" alt="2" width="526" height="344" border="0"><br>
      Figura 29. Importaci&oacute;n Fichero de  Intercambio de Informaci&oacute;n
      </p>
    </div>
    <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pulsando el bot&oacute;n (<img src="./img/InformacionTitularidad3.gif" alt="3" width="47" height="22" border="0">) de selecci&oacute;n del campo <strong>Seleccione el certificado digital</strong> el usuario podr&aacute; seleccionar el  certificado adecuado para la conexi&oacute;n con el servicio web de intercambio de  informaci&oacute;n de a Direcci&oacute;n General de Catastro. El usuario adem&aacute;s deber&aacute;  introducir la contrase&ntilde;a correcta en el campo <strong>Introduzca su contrase&ntilde;a</strong>.</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad4.jpg" alt="4" width="527" height="346" border="0"><br>
Figura 30. Petici&oacute;n de Certificado y  Contrase&ntilde;a.</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez introducidos los datos se  pulsar&aacute; en el bot&oacute;n <strong>Siguiente</strong> de la  ventana, y si el certificado seleccionado o la contrase&ntilde;a introducida por el  usuario no son los correctos, se mostrar&aacute; por pantalla un error cuyos detalles  podr&aacute;n verse pulsando en el bot&oacute;n <strong>Mostrar  Detalles</strong> de la pantalla de dicho error (figuras 31 y 32). Si se pulsa sobre  el bot&oacute;n <strong>OK</strong> del error se volver&aacute; a  la pantalla de inserci&oacute;n de los datos del certificado donde se habr&aacute; borrado el  campo de <strong>Introduzca su contrase&ntilde;a</strong>.</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad5.jpg" alt="5" width="506" height="122" border="0"><br>
Figura 31. Error de Certificaci&oacute;n.</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad6.jpg" alt="6" width="512" height="322" border="0"><br>
Figura 32. Error Certificaci&oacute;n  detallado</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez seleccionado el  certificado e introducida la contrase&ntilde;a correcta, y tras pulsar el bot&oacute;n <strong>Siguiente</strong> de la ventana aparecer&aacute; un  reloj que nos indicar&aacute; el progreso de la operaci&oacute;n de intercambio de la informaci&oacute;n.  En primer lugar nos indicar&aacute; que se est&aacute; realizando la petici&oacute;n de los datos a la    D. Catastro (Figura 33) y si &eacute;sta se ha  realizado con &eacute;xito nos indicar&aacute; que se encuentra recibiendo la respuesta de  Catastro (Figura 34).</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad7.jpg" alt="7" width="399" height="101" border="0"><br>
Figura 33. Petici&oacute;n de datos</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad8.jpg" alt="8" width="400" height="100" border="0"><br>
Figura 34. Recibiendo Respuesta</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez que se haya recibido la  respuesta esta herramienta analizar&aacute; la informaci&oacute;n que le ha llegado,  pudi&eacute;ndose encontrar con dos posibles situaciones:</p>
<ul>
  <li class="contenidonormal">Respuesta con la informaci&oacute;n  de catastro.<br>
    <br>
  </li>
  <li class="contenidonormal">Respuesta con un listado de  errores.</li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La primera de ellas consiste en que la D.G.Catastro nos mande la  informaci&oacute;n correcta que se ha solicitado, de manera que se pasar&aacute; a insertar  en la base de datos del sistema. <br>
  Si durante el proceso de  inserci&oacute;n se produce alg&uacute;n error se mostrar&aacute; en una ventana de error que  podremos ver con m&aacute;s detalle al pulsar en el bot&oacute;n <strong>Mostrar Detalles</strong> (Figuras 35 y 36).</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad9.jpg" alt="9" width="506" height="122" border="0"><br>
Figura 35. Error en la inserci&oacute;n</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad10.jpg" alt="10" width="512" height="322" border="0"><br>
Figura 36. Error en la inserci&oacute;n  detallado</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez haya finalizado la  inserci&oacute;n de los datos enviados por la Direcci&oacute;n General  de Catastro se mostrar&aacute; una ventana en la que se nos indica el estado de la  realizaci&oacute;n de cada uno de los procesos realizados (Figura 37). Estos procesos  son:</p>
<ul>
  <li class="contenidonormal"><strong>Conectando a la OVC</strong>: conexi&oacute;n con el servicio web de la D.G. Catastro.<br>
    <br>
  </li>
  <li class="contenidonormal"><strong>Validando  el fichero obtenido</strong>: proceso de validaci&oacute;n de la respuesta enviada por  Catastro.<br>
    <br>
  </li>
  <li class="contenidonormal"><strong>Actualizando  informaci&oacute;n del sistema</strong>: inserci&oacute;n de los datos recibidos en la base de  datos del sistema.<br>
    <br>
  </li>
  <li class="contenidonormal"><strong>Proceso de informaci&oacute;n finalizado</strong>:  indica si todo el proceso de intercambio de la informaci&oacute;n se ha realizado o no  correctamente. </li>
</ul>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad11.jpg" alt="11" width="526" height="344" border="0"><br>
Figura 37. Finalizaci&oacute;n Inserci&oacute;n</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El segundo tipo de respuesta  posible dar&aacute; como resultado que aparezca por pantalla un mensaje de error con  los distintos errores que se encuentran dentro de la respuesta enviada por  Catastro. Al pulsar sobre el bot&oacute;n <strong>Mostrar  Detalles</strong> el usuario podr&aacute; ver el c&oacute;digo del error y la descripci&oacute;n del  mismo, valores ambos contenidos en la respuesta (Figuras 38 y 39).</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad12.jpg" alt="12" width="506" height="122" border="0"><br>
Figura 38. Error en la Validaci&oacute;n de la Respuesta</p>
<p align="center" class="contenidonormal"><img src="./img/InformacionTitularidad13.jpg" alt="13" width="512" height="322" border="0"><br>
Figura 39. Error en la validaci&oacute;n de la  respuesta detallado</p>
<p class="contenidonormal"><strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;IMPORTANTE</strong>: hay que tener en cuenta  que debido a que el servicio web de la   D.G. de Catastro todav&iacute;a no se encuentra disponible, se han  tenido que hacer algunas modificaciones en los importadores para que se puedan  probar estas herramientas. En el importador del Fichero de intercambio de  informaci&oacute;n (punto 2.4) para poder probarlo hay que simular la respuesta que  dar&iacute;a el servicio web de Catastro. Esto tiene que hacerse a trav&eacute;s de un  fichero situado en C:\ y que se llame prueba.xml.<br>
  <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Como ya se ha comentado en el  punto 2.4 hay dos tipos de respuesta distintas, seg&uacute;n nos manden la informaci&oacute;n  de Catastro o la lista de los errores. Para simular la respuesta habr&aacute; que  copiar cada fichero con el tipo de respuesta correspondiente a la ubicaci&oacute;n C:\  y renombrarlo como prueba.xml. Para probar cada uno de los casos posibles habr&aacute;  que repetir la operaci&oacute;n.<br>
  <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Estos ficheros que se encargan de  simular la respuesta del servicio web de Catastro se llaman  catastro_consultaresponse.xml&nbsp; (respuesta  con los datos de Catastro) y catastro_consultaresponseerror.xml (respuesta con  la lista de errores enviados). Habr&aacute; que copiar estos ficheros en C:\ con el  nombre prueba.xml. NO hay que borrar estos ficheros, habr&aacute; que mantener los  originales con los nombres originales para no perder la informaci&oacute;n de ninguno  de ellos.</p>

</body>
</html>
