<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro" >Herramientas de edici&oacute;n.  Escalado de elementos </h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta herramienta permite escalar las entidades seleccionadas del dibujo.  Consta de un &uacute;nico bot&oacute;n dentro del panel de herramientas de edici&oacute;n <img src="./img/iconoedicion.gif" alt="1" width="24" height="24">, con el siguiente aspecto: <img src="./img/iconoescalado.gif" alt="2" width="20" height="20">.<br>
  &nbsp;<br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta opci&oacute;n estar&aacute; accesible para todos los  usuarios del editor GIS.</p>
<p align="center"><img src="./img/ejemploescalado.jpg" alt="3" width="598" height="449"></p>
 <p class="contenidonormal"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El usuario escoge una &uacute;nica entidad dentro del editor de GeoPISTA y  selecciona la herramienta de escalado de la caja de Edici&oacute;n. Con ayuda del  rat&oacute;n, el usuario ajusta el tama&ntilde;o definitivo de la entidad. Hay dos modos  posibles de realizar el escalado de una entidad:</p>
<ul>
  <li>
    <div align="justify" class="contenidonormal"> 
      <div align="left">Escalado  respecto al centro geom&eacute;trico de la entidad. </div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal"> 
      <div align="left">Respecto a un  punto de la entidad que se haya seleccionado previamente. Para seleccionar este  punto de referencia habr&aacute; que pulsar con el rat&oacute;n en las proximidades del punto  a seleccionar, haciendo clic sobre el mapa. Una vez se haya seleccionado se  marcar&aacute; este punto en el mapa con un c&iacute;rculo.</div>
    </div>
  </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para ajustar el tama&ntilde;o del escalado que se desea obtener hay dos formas  posibles:</p>
<ul>
  <li>
    <div align="justify" class="contenidonormal"> 
      <div align="left">Una vez  seleccionada la entidad y tras pulsar sobre el bot&oacute;n de la herramienta habr&aacute;  que pulsar con el rat&oacute;n dentro del mapa y sin soltar el bot&oacute;n arrastrarlo hasta  obtener el escalado deseado. El factor de escala se mostrar&aacute; en la caja de  texto del panel de las herramientas de edici&oacute;n. Si el rat&oacute;n se aleja del centro  de referencia la entidad aumentar&aacute; de tama&ntilde;o y se reducir&aacute; en caso contrario.</div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Introducir el  factor de escalado en la caja de texto del panel de las herramientas de  edici&oacute;n. Los cambios se ir&aacute;n mostrando en el mapa seg&uacute;n se var&iacute;a este factor,  pero s&oacute;lo se realizar&aacute; el escalado cuando se pulse el bot&oacute;n de Intro del  teclado.</div>
    </div>
  </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para que esta herramienta funcione correctamente el usuario tendr&aacute; que  seleccionar una &uacute;nica entidad antes de pulsar sobre el bot&oacute;n de la herramienta  y adem&aacute;s esta entidad deber&aacute; encontrarse en una capa editable del mapa. En caso  contrario se mostrar&aacute; un mensaje en la barra de estado del GIS indicando al  usuario lo ocurrido.</p>

</body>
</html>
