<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Herramientas de edici&oacute;n. Creaci&oacute;n de gu&iacute;as de dibujo</h1>
<ul>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left"><img src="./img/iconogrid.gif" alt="1" width="25" height="25">&nbsp;Creaci&oacute;n de gu&iacute;as de dibujo o referencias de  dise&ntilde;o. </div>
    </div>
  </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El sistema permitir&aacute; visualizar la rejilla en dos formatos posibles, bien a  trav&eacute;s de l&iacute;neas o por puntos.</p>
    <div align="center"><img src="./img/ejemplogrid.jpg" alt="2" width="586" height="440">
<p class="contenidonormal">      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Consta de un &uacute;nico bot&oacute;n dentro del panel de herramientas de edici&oacute;n <img src="./img/iconoedicion.gif" alt="3" width="24" height="24">, con el siguiente aspecto: <img src="./img/iconogridpequenio.gif" alt="4" width="30" height="29">. Al pulsarlo, aparece la siguiente interfaz:</p>
      <img src="./img/panelgrid.jpg" alt="5" width="350" height="190"><br>
 <p align="left" class="contenidonormal"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta interfaz consta de los siguientes elementos:  </p>
</div>
    <ul>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Checkbox  Mostrar rejilla: Si est&aacute; marcado, indica que se desea mostrar una gu&iacute;a de  dibujo. En tal caso, se habilitan el resto de componentes de la interfaz  (excepto el bot&oacute;n de Cancelar, que siempre estar&aacute; habilitado).</div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Cuadro de  texto Tama&ntilde;o: Contiene el tama&ntilde;o de la rejilla, indicado en las unidades que se  est&eacute;n utilizando en el modelo.</div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Bot&oacute;n de  radio Formato de rejilla: Si est&aacute; marcado, indica que se utilizar&aacute;n puntos como  gu&iacute;a de dibujo y autom&aacute;ticamente se desmarcar&aacute; la opci&oacute;n de Ajustar a v&eacute;rtices  y l&iacute;neas. Si no est&aacute; marcado, se utilizan l&iacute;neas punteadas.</div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Bot&oacute;n de  radio Ajustar a v&eacute;rtices y l&iacute;neas: Si est&aacute; marcado, indica que se utilizar&aacute;n  puntos como gu&iacute;a l&iacute;neas de dibujo y autom&aacute;ticamente se desmarcar&aacute; la opci&oacute;n de  Formato de rejilla. </div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Bot&oacute;n  Aceptar: Al pulsarlo, se aplica la gu&iacute;a de dibujo al mapa. </div>
    </div>
  </li>
  <li>
    <div align="justify" class="contenidonormal">
      <div align="left">Bot&oacute;n  Cancelar: Al pulsarlo, se regresa a la pantalla original, sin a&ntilde;adir ninguna  gu&iacute;a ni referencia de dibujo.</div>
    </div>
  </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta opci&oacute;n estar&aacute; accesible para todos los  usuarios del editor GIS. <br>
  &nbsp;<br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El usuario presionar&aacute; el  bot&oacute;n de esta herramienta de manera que se mostrar&aacute; el panel donde pasar&aacute; a  introducir los datos; una vez seleccionado el formato de la rejilla y el  tama&ntilde;o, pulsar&aacute; Aceptar y se mostrar&aacute; la rejilla correspondiente en el mapa.<br>
Este bot&oacute;n siempre se  encontrar&aacute; habilitado.</p>
<div align="center"><img src="./img/ejemplogridpuntos.jpg" alt="6" width="610" height="458">  </div>
</body>

</html>
