<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Campos en el informe</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P>Campos en el informe</P>
</B></U><P>En esta secci&oacute;n se a&ntilde;adir&aacute;n los campos que se deseen al informe.</P>
<P>&nbsp;</P>
</FONT><P><IMG SRC="Image41.jpg" WIDTH=771 HEIGHT=601></P>
<FONT FACE="Verdana"><P>Los campos que se a&ntilde;adan podr&aacute;n ser campos:</P>

<UL>
<B><LI>No Espaciales</B>: &#9;Procedentes de la base de datos </LI>
<B><LI>Espaciales</B>: &#9;Resultantes de realizar operaciones espaciales, con el campo geometr&iacute;a de las capas.</LI></UL>

<P>En Ambos campos se podr&aacute;n especificar las funciones de agregado mediante los cuadros combinados de <B>Agregado</B>.</P>
<P>&#9;Las funciones disponibles son :</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="50%" VALIGN="TOP">

<UL>
<FONT FACE="Verdana"><LI>Suma</FONT></TD>
<TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana"><LI>Media</FONT></TD>
</TR>
<TR><TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana"><LI>M&iacute;nimo</FONT></TD>
<TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana"><LI>M&aacute;ximo</FONT></TD>
</TR>
<TR><TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana"><LI>Contar</UL>
</FONT></TD>
<TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana"><P>&nbsp;</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana"><P>&nbsp;</P>
<P>&nbsp;</P><DIR>
<DIR>

<P>En los campos <B>Etiqueta </B>se pondr&aacute; el nombre que se quiera que aparezca en el listado.</P>
<P>Con la casilla de verificaci&oacute;n <B>Crear subtotales</B>, se crear&aacute;n los subtotales (suma) de los registros correspondientes al campo seleccionado.</P>
<P>Las operaciones que se generen con los campos espaciales podr&aacute;n ser :</P></DIR>
</DIR>


<UL><DIR>
<DIR>
<DIR>
<DIR>


<UL>
<LI>&Aacute;rea </LI>
<LI>Longitud</LI></UL>
</DIR>
</DIR>
</DIR>
</DIR>
</UL>

<P>&nbsp;</P>
<P>Para a&ntilde;adir un campo al informe bien sea campo espacial o normal, se deber&aacute; pulsar el bot&oacute;n <IMG SRC="Image42.jpg" WIDTH=49 HEIGHT=27></P><DIR>
<DIR>

<P>&nbsp;</P></DIR>
</DIR>

<P>A medida que se vayan introduciendo campos en el informe se ir&aacute; rellenando la tabla siguiente:</P>
</FONT><P><IMG SRC="Image43.jpg" WIDTH=563 HEIGHT=162></P>
<FONT FACE="Verdana"><P>&nbsp;</P>
<P>Este seria el orden de aparici&oacute;n en el informe de los campos.</P>
<P>Para quitar un campo del informe se pulsar&aacute; el bot&oacute;n: <IMG SRC="Image44.jpg" WIDTH=36 HEIGHT=31></P>
<P>Para cambiar el orden en que va a aparecer el campo en el informe se seleccionar&aacute; el campo en la tabla anterior y se pulsar&aacute; a los botones <IMG SRC="Image45.jpg" WIDTH=39 HEIGHT=32>o <IMG SRC="Image46.jpg" WIDTH=39 HEIGHT=34></P>
<P>&nbsp;</P>
<P>Los campos aparecer&aacute;n en el informe en forma de columna, hay que tener en cuenta la limitaci&oacute;n del ancho de la hoja para introducir los campos, porque puede ocurrir que no se vean todos en el informe.</P>
<P>El &uacute;ltimo paso del asistente, que se explicar&aacute; en el &uacute;ltimo punto, permite al usuario ejecutar el informe o bien entrar en el mismo para cambiar el dise&ntilde;o.</P>
<P>Los campos que aparecer&aacute;n en el informe son los que est&aacute;n contenidos en la tabla.</P>
<P>El informe tendr&aacute; por lo menos un campo, sino se a&ntilde;ade ninguno el asistente no dejar&aacute; continuar.</P></FONT></BODY>
</HTML>
