<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Importar topónimos</TITLE>
</HEAD>
<BODY>

<B><U><FONT FACE="Verdana"><P>Importar top&oacute;nimos</P>
</B></U></FONT><FONT FACE="Verdana" SIZE=3>
<P>Para importar un fichero de top&oacute;nimos dir&iacute;jase al m&oacute;dulo denominado &quot;Informaci&oacute;n de referencia&quot; y seleccione la opci&oacute;n &quot;Importar Top&oacute;nimos.&quot; El fichero de top&oacute;nimos debe ser de tipo &quot;shapefile (*.shp)&quot; cuya geometr&iacute;a debe ser de puntos.</P>

<P>Autom&aacute;ticamente, se cargar&aacute; el mapa de Informaci&oacute;n de Referencia sobre el cual se van a importar los top&oacute;nimos.</P>

<P>&nbsp;</P>
<P><IMG SRC="Image224.jpg" WIDTH=564 HEIGHT=57></P>

<P><IMG SRC="Image225.jpg" WIDTH=507 HEIGHT=414></P>

<P>Elija el fichero que desea importar pulsando sobre el bot&oacute;n de cargar fichero, representado con el icono de una una carpeta abierta.</P>

<P><IMG SRC="Image226.jpg" WIDTH=486 HEIGHT=76></P>

<P>Una vez hecho esto, el sistema le indicar&aacute; que esta operaci&oacute;n puede tardar unos minutos. Por favor, tenga paciencia y espere a que finalice el proceso. En caso de error, la causa m&aacute;s probable seguramente sea que el fichero a importar no cumple con el esquema definido para un fichero de top&oacute;nimos.</P>

<P><IMG SRC="Image227.jpg" WIDTH=148 HEIGHT=93></P>

<P>Si todo ha sido correcto el sistema le mostrar&aacute; el siguiente mensaje:</P>

<P><IMG SRC="Image228.jpg" WIDTH=146 HEIGHT=73></P>
<P>Tras lo cual si se fija en el mapa, podr&aacute; observar que una nueva capa denominada top&oacute;nimos aparece cargada en el mapa de Informaci&oacute;n de Referencia en la categor&iacute;a &quot;Import&quot;.</P>

<P><IMG SRC="Image229.jpg" WIDTH=484 HEIGHT=386></P>

<P>Seleccione dicha capa y haga activa ver&aacute; como aparecen los top&oacute;nimos procedentes del proceso de importaci&oacute;n descrito anteriormente. El resultado deber&iacute;a parecerse a &eacute;ste:</P>

<P><IMG SRC="Image230.jpg" WIDTH=218 HEIGHT=224></P></FONT></BODY>
</HTML>
