<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>EXPEDIR INFORME URBANÍSTCO</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P><A NAME="_Toc85534522">EXPEDIR INFORME URBAN&Iacute;STCO</A></P>
</B></U><P>Esta opci&oacute;n generar&aacute; un informe urban&iacute;stico de la parcela que se seleccione sobre el mapa, que aparece en pantalla.</P>
</FONT><P><IMG SRC="Image106.jpg" WIDTH=566 HEIGHT=463></P>
<FONT FACE="Verdana"><P>En esta interface aparecen las capas cargadas necesarias para realizar el informe urban&iacute;stico.</P>
<P>Adem&aacute;s aparece la barra de herramientas que nos va a permitir:</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=630>
<TR><TD WIDTH="8%" VALIGN="TOP">
<FONT FACE="Verdana"><P>&nbsp;</P>
</FONT><P><IMG SRC="Image76.gif" WIDTH=27 HEIGHT=28></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana"><P>Pinchando y arrastrando sobre el mapa se provoca un zoom a la zona seleccionada.</P>
<P>Haciendo clic con el bot&oacute;n derecho sobre el mapa se provoca un alejamiento </FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image77.gif" WIDTH=30 HEIGHT=29></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana"><P>Herramienta para desplazar el plano por la pantalla</FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image78.gif" WIDTH=29 HEIGHT=29></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana"><P>Haciendo clic sobre esta herramienta se hace un zoom a la extensi&oacute;n del mapa</FONT></TD>
</TR>
<TR><TD WIDTH="8%" VALIGN="TOP">
<P><IMG SRC="Image79.gif" WIDTH=27 HEIGHT=27></TD>
<TD WIDTH="92%" VALIGN="TOP">
<FONT FACE="Verdana"><P>Herramienta para seleccionar un elemento del plano</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana"><P>Una vez se haga el zoom deseado sobre la zona buscada, se seleccionar&aacute; la herramienta de selecci&oacute;n para identificar la parcela.</P>
<P>Una vez que se identifique una parcela, se rellenar&aacute;n las casillas de r&uacute;stica o urbana, dependiendo el tipo de la misma.</P>
</FONT><P><IMG SRC="Image107.jpg" WIDTH=566 HEIGHT=459></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<FONT FACE="Verdana"><P>Una vez seleccionada, se pulsar&aacute; el bot&oacute;n <B>siguiente</B> y se lanzar&aacute; el Informe Urban&iacute;stico.</P>
</FONT><P><IMG SRC="Image108.jpg" WIDTH=522 HEIGHT=498></P>
<FONT FACE="Verdana"><P>Hay que tener en cuenta que el informe que se genera y se previsualiza en pantalla se deber&aacute; exportar a un formato de archivos <B>PDF, </B>para su posterior impresi&oacute;n.</P>
<P>En la previsualizaci&oacute;n del informe no se aprecian todos los detalles del mismo, se deber&aacute; primero exportar a PDF, como se dijo en el p&aacute;rrafo anterior, y luego imprimirlo.</P>
<P>&nbsp;</P>
<P>Par exportar un informe a un tipo de fichero se usar&aacute; la siguiente barra de Herramientas y Men&uacute;s</P>
</FONT><P><IMG SRC="Image109.jpg" WIDTH=271 HEIGHT=53></P>
<FONT FACE="Verdana"><P>Para imprimir un informe se har&aacute; de dos formas:</P>

<UL>
<LI>Desde el Men&uacute; <B>File-Print </LI>
</B><LI>Con el bot&oacute;n de la barra de herramientas <IMG SRC="Image110.gif" WIDTH=32 HEIGHT=29></LI></UL>

<P>Para exportar el informe a PDF se har&aacute; desde</P>

<UL>
<LI>Desde el men&uacute; <B>Report-Export </LI>
</B><LI>Con el bot&oacute;n de la barra de herramientas <IMG SRC="Image111.gif" WIDTH=31 HEIGHT=29>&nbsp;</LI></UL>

<P>&nbsp;</P></FONT></BODY>
</HTML>
