<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">CONTENIDOS DEL GESTOR DE  CAPAS</h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para ejecutar el Gestor de Capas  se ejecuta el fichero geopista_gestor_capas.jnlp, bien a trav&eacute;s de un  explorador web, mediante la ruta:<br>
    http://DIR_SERVIDOR_TOMCAT:8080/software/geopista_gestor_capas.jnlp, <br>
  o bien pulsando en el icono  creado en el escritorio por JavaWebStart si ya se ha ejecutado previamente la  aplicaci&oacute;n:</p>
  <div align="center"><img src="./img/ContenidosGestosDeCapas1.gif" alt="1" width="87" height="89" border="0"></div>
  <p class="contenidonormal">
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El JavaWebStart se iniciar&aacute; y se  lanzar&aacute; la aplicaci&oacute;n, solicitando la contrase&ntilde;a de usuario. </p>
  <div align="center"><img src="./img/ContenidosGestosDeCapas2.jpg" alt="2" width="216" height="167" border="0"></div>
  <p class="contenidonormal">
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez finalizado el proceso de  inicio, y tras autenticarse, el Gestor de Capas mostrar&aacute; el siguiente aspecto:</p>
  <div align="center"><img src="./img/ContenidosGestosDeCapas3.jpg" alt="3" width="642" height="412" border="0">
      </p>
  </div>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La herramienta est&aacute; dividida en cuatro  pesta&ntilde;as:</p>
<ul>
  <li class="contenidonormal"> Tablas</li>
  <li class="contenidonormal"> Dominios</li>
  <li class="contenidonormal"> Capas</li>
  <li class="contenidonormal"> Familias de capas</li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Es necesario para continuar con  la lectura del documento que el lector est&eacute; familiarizado con los conceptos de <em>layer</em> o capa, <em>layerfamily</em> o categor&iacute;a, dominio y <em>domainnode</em>, as&iacute; como con la manipulaci&oacute;n de las tablas del sistema  asociadas a la gesti&oacute;n de capas (<em class="contenidonormal">tables,  columns, query_catalog, attributes, </em>etc.) de las que se puede encontrar m&aacute;s  informaci&oacute;n en el Modelo de Datos. Tambi&eacute;n el lector debe comprender la  diferencia entre las tablas de la base de datos, y las tablas de sistema (o de  GeoPISTA).<br>
  En los siguientes apartados se  explicar&aacute; el cometido de cada una de las pesta&ntilde;as de la aplicaci&oacute;n y su forma  de utilizaci&oacute;n. </p>
</body>
</html>
