<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">INTRODUCCI&Oacute;N
</h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La herramienta de Gesti&oacute;n de  Capas permite a un usuario de tipo Administrador la manipulaci&oacute;n de capas y  todo lo relacionado con ellas de un modo m&aacute;s sencillo del que se ven&iacute;a  utilizando hasta el momento, y evitando el acceso directo a la base de  datos.&nbsp; <br>
  <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se trata de una aplicaci&oacute;n  stand-alone dependiente de GeoPista, que realiza una serie de consultas contra la Base de Datos, y que permite  realizar las siguientes operaciones:</p>
<ul>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Creaci&oacute;n, modificaci&oacute;n y  borrado de tablas y columnas de Base de Datos, y de sus tablas y columnas de  sistema asociadas.<br>
            <br>
            <br>
          </div>
        </div>
      </li>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Asociaci&oacute;n de dominios a las  columnas de tablas ya existentes en el sistema.<br>
              <br>
            <br>
          </div>
        </div>
      </li>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Creaci&oacute;n de nuevos dominios y  modificaci&oacute;n y borrado de los existentes, haciendo para ello uso de la  herramienta de gesti&oacute;n de dominios.<br>
              <br>
            <br>
          </div>
        </div>
      </li>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Creaci&oacute;n, modificaci&oacute;n y  borrado de capas de sistema.<br>
            <br>  
            <br>
          </div>
        </div>
      </li>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Creaci&oacute;n y eliminaci&oacute;n de  relaciones de asociaci&oacute;n entre capas (<em>layers</em>)  y categor&iacute;as (<em>layerfamilies</em>).<br>
            <br>
            <br>
          </div>
        </div>
      </li>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Creaci&oacute;n, edici&oacute;n y borrado de  una <em class="contenidonormal">layerfamily</em>.<br>
            <br>
            <br>
          </div>
        </div>
      </li>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">Reordenaci&oacute;n de las capas  dentro de una <em>layerfamily</em>.</div>
        </div>
      </li>
</ul>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Todas estas operaciones se  realizaban de forma manual sobre las tablas correspondientes de la base de  datos, por lo que el usuario deb&iacute;a tener conocimientos avanzados sobre el  modelo relacional subyacente. Con esta herramienta se ofrece una interfaz que  permite simplificar este tipo de operaciones, realiz&aacute;ndolas de manera m&aacute;s  eficiente y segura, si bien sigue siendo necesario un conocimiento b&aacute;sico del  modelo de datos. </p>

</body>
</html>
