<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Introducci&oacute;n </h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta herramienta permite la
sincronizaci&oacute;n de la informaci&oacute;n existente en la aplicaci&oacute;n Avanza Local Padr&oacute;n
con la informaci&oacute;n de LocalGIS. De esta manera podr&aacute; garantizarse la
sincronizaci&oacute;n de la informaci&oacute;n existente en ambas plataformas concerniente a
los datos del INE.</p>

<p class="contenidonormal">En particular esta herramienta permitir&aacute; el intercambio de la siguiente informaci&oacute;n:</p>

<p class="contenidonormal">
	<ul>
		<li class="contenidonormal">Alta Callejero: permite gestionar las altas de las calles que se hayan realizado en la aplicaci&oacute;n
Avanza Local padr&oacute;n (ALP).</li>

<li class="contenidonormal">Alta Numerero: posibilita la
incorporaci&oacute;n en el sistema de los n&uacute;meros de polic&iacute;a que se hayan dado de alta
previamente en ALP.</li>

<li class="contenidonormal">Modificaci&oacute;n Callejero: se
encargar&aacute; de incorporar las modificaciones realizadas sobre el callejero desde
ALP en LocalGIS.</li>

<li class="contenidonormal">Modificaci&oacute;n Numerero:
permite incorporar en el sistema las modificaciones del numerero realizadas en
ALP. </li>

<li class="contenidonormal">Baja Callejero: se encarga de
sincronizar las bajas en el callejero que se hayan realizado en ALP</li>

<li class="contenidonormal">Baja Numerero: gestiona las
bajas de los n&uacute;meros de polic&iacute;a que se hayan realizado previamente en ALP.</li>

</ul></p>

<p class="contenidonormal">Con esta herramienta se
conseguir&aacute; incorporar la informaci&oacute;n acerca de las calles y n&uacute;meros de polic&iacute;a
perteneciente al INE a la informaci&oacute;n de catastro existente en LocalGIS.</p>

<p class="contenidonormal">Esta herramienta est&aacute;
diferenciada en dos zonas, una de ellas destinada a contener la informaci&oacute;n
alfanum&eacute;rica, parte izquierda de la pantalla, y la otra destinada a la
visualizaci&oacute;n geogr&aacute;fica, parte derecha de la pantalla.</p><p class="contenidonormal"><br></p>


<p class="contenidonormal"> 
  <div align="center"><img src="./img/Introduccion.jpg">      
  </div>
  </p>
  
</body>

</html>
