<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Importacion del Fichero Fin de Salida</title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h2 class="cabeceraazuloscuro">Importaci&oacute;n del Fichero FIN de  Salida</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A trav&eacute;s de esta herramienta los  usuarios podr&aacute;n importar en el sistema la informaci&oacute;n recogida en el fichero  FIN de Salida de la D.G.  de Catastro, el cual permitir&aacute; actualizar la informaci&oacute;n de Catastro real con  la informaci&oacute;n m&aacute;s actualizada de la base de datos maestra de Catastro. Este  fichero deber&aacute; cumplir con la estructura empleada y definida por la D.G. Catastro (http://www.catastro.meh.es/esp/colaboradores1.asp#menu4). </p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para acceder a esta herramienta  habr&aacute; que pulsar en la opci&oacute;n <strong>FIN de Salida</strong> del men&uacute; dentro de la pesta&ntilde;a <strong class="contenidonormal">Importaci&oacute;n  de Ficheros </strong>(Figura 10). Una vez realizada esta acci&oacute;n a parecer&aacute; la  ventana que permitir&aacute; la importaci&oacute;n de los datos (Figura 11).</p>
<p align="center" class="contenidonormal"><img src="./img/FinSalida1.jpg" alt="1" width="323" height="181" border="0"><br>
Figura 10. Selecci&oacute;n en el men&uacute;</p>
<p align="center" class="contenidonormal"><img src="./img/FinSalida2.jpg" alt="2" width="645" height="580" border="0"><br>
Figura 11. Importaci&oacute;n FIN de Salida</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A trav&eacute;s de esta ventana se podr&aacute;  importar la informaci&oacute;n contenida en el fichero FIN de Salida de la D.G. de Catastro. <br>
  Dentro de <strong class="contenidonormal">Informaci&oacute;n de la importaci&oacute;n</strong> habr&aacute; que seleccionar el tipo de  fichero a importar (&uacute;nicamente podr&aacute; ser XML), los datos que se van a importar  (FIN de Salida) y se seleccionar&aacute; el fichero con la informaci&oacute;n; todo esto se  realiza a trav&eacute;s de los campos <strong>Tipo de  fichero</strong>, <strong>Datos a Importar</strong> y <strong>Fichero a Importar</strong>, pulsando el bot&oacute;n  de este &uacute;ltimo (<img src="./img/FinSalida3.gif" alt="3" width="47" height="22" border="0">) se abrir&aacute; un explorador de archivos que nos  permitir&aacute; seleccionar el fichero concreto a importar.<br>
Una vez seleccionado el fichero  que se quiere importar dar&aacute; comienzo la validaci&oacute;n de la informaci&oacute;n contenida  en el fichero para ver si se corresponde con la estructura empleada por la D.G.C (Figura 12). </p>
  <div align="center" class="contenidonormal"><img src="./img/FinSalida4.jpg" alt="4" width="642" height="579" border="0"><br>
    Figura 12. Proceso de Validaci&oacute;n
    </p>
  </div>
  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El progreso de esta validaci&oacute;n y  su resultado final se mostrar&aacute; en el campo <strong>Estado  de la Validaci&oacute;n  del proceso de Importaci&oacute;n</strong>, de manera que podremos conocer el resultado de  esta.</p>
    <div align="center" class="contenidonormal"><img src="./img/FinSalida5.jpg" alt="5" width="645" height="585" border="0"><br>
      Figura 13. Resultado de la Validaci&oacute;n
      </p>
    </div>
    <p align="center" class="contenidonormal"><img src="./img/FinSalida6.jpg" alt="6" width="644" height="581" border="0"><br>
Figura 14. Validaci&oacute;n Err&oacute;nea</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Si la validaci&oacute;n se ha realizado  con &eacute;xito se habilitar&aacute; el bot&oacute;n <strong>Siguiente</strong> de la ventana de importaci&oacute;n, en caso contrario permanecer&aacute; deshabilitado y se  indicar&aacute; que el fichero no es correcto (Figuras 13 y 14).<br>
  Una vez que se haya pulsado el  bot&oacute;n <strong>Siguiente</strong> comenzar&aacute; la  importaci&oacute;n de los datos, de manera que se almacenar&aacute;n en la base de datos,  indicando una vez haya finalizado el proceso los resultados de la importaci&oacute;n.<br>
  Los resultados de la importaci&oacute;n  se mostrar&aacute;n en una nueva ventana en el campo <strong>Resultado de la   Importaci&oacute;n</strong>, indicando las estad&iacute;sticas de la importaci&oacute;n  realizada (Figura 15).</p>
  <div align="center" class="contenidonormal"><img src="./img/FinSalida7.jpg" alt="7" width="644" height="581" border="0"><br>
    Figura 15. Resultado de la importaci&oacute;n
    </p>
  </div>
  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Durante el proceso de la  importaci&oacute;n de los datos, puede que ocurran errores en la inserci&oacute;n o  actualizaci&oacute;n de los datos contenidos en el fichero, estos errores se mostrar&aacute;n  en una ventana de error. Para ver el error que se ha producido con m&aacute;s detalle  habr&aacute; que pulsar sobre el bot&oacute;n <strong>Mostrar  Detalles</strong> de esta ventana de error (Figuras 16 y 17).</p>
<p align="center" class="contenidonormal"><img src="./img/FinSalida8.jpg" alt="8" width="506" height="122" border="0"><br>
  Figura 16. Error de Inserci&oacute;n<br>
  <br>
  <img src="./img/FinSalida9.jpg" alt="9" width="511" height="321" border="0"><br>
Figura 17. Error de Inserci&oacute;n detallado</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para dar por finalizada la  importaci&oacute;n de los datos hay que pulsar en el bot&oacute;n Finalizar de la  herramienta. <br>
  Adem&aacute;s se podr&aacute; cancelar en  cualquier momento el proceso de importaci&oacute;n pulsando sobre el bot&oacute;n <strong>Cancelar</strong>, de manera que se cerrar&aacute; la  ventana de importaci&oacute;n del padr&oacute;n catastral.<br>
  Por &uacute;ltimo podremos volver a la  ventana anterior pulsando en&nbsp; el bot&oacute;n <strong>Anterior</strong>, permitiendo as&iacute; repetir la  tarea de importaci&oacute;n de los datos de la misma manera que se ha indicado.</p>

</body>
</html>
