<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Importacion del Fichero Fin de Retorno Masivo</title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h2 class="cabeceraazuloscuro">Importaci&oacute;n del Fichero FIN de  Retorno Masivo</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta opci&oacute;n permite a los  usuarios importar en el sistema la informaci&oacute;n recogida en el fichero FIN DE  RETORNO generado por la D. G. de  Catastro. Este fichero FIN DE RETORNO deber&aacute; cumplir la estructura y esquema de  la D.G. Catastro
  &nbsp;<span class="contenidonormal">(http://www.catastro.meh.es/esp/colaboradores1.asp#menu4</span>)<br>
  <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para ejecutar esta herramienta  habr&aacute; que pulsar en la opci&oacute;n <strong>FIN de retorno  masivo</strong> dentro de la opci&oacute;n del men&uacute; <strong>Importaci&oacute;n  de Ficheros </strong>(Figura 18). Una vez pulsada esta pesta&ntilde;a del men&uacute; aparecer&aacute; la  ventana que nos permitir&aacute; realizar la importaci&oacute;n del fichero FIN de Retorno  Masivo (Figura 19).</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno1.jpg" alt="1" width="323" height="181" border="0"><br>
Figura 18. Selecci&oacute;n en el men&uacute;</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno2.jpg" alt="2" width="644" height="581" border="0"><br>
Figura 19. Importador FIN de Retorno  Masivo</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En la parte de la ventana  agrupada bajo en nombre de <strong>Informaci&oacute;n  de la importaci&oacute;n</strong> habr&aacute; que seleccionar el tipo de fichero a importar  (&uacute;nicamente podr&aacute; ser XML), los datos que se van a importar (FIN de Retorno  Masivo) y se seleccionar&aacute; el fichero con la informaci&oacute;n; todo esto se realiza a  trav&eacute;s de los campos <strong>Tipo de fichero</strong>, <strong>Datos a Importar</strong> y <strong>Fichero a Importar</strong>. Pulsando el bot&oacute;n  de este &uacute;ltimo (<img src="./img/FinRetorno3.gif" alt="3" width="47" height="22" border="0">) se abrir&aacute; un explorador de archivos que nos  permitir&aacute; seleccionar el fichero concreto a importar.<br>
  Una vez seleccionado el fichero  que se quiere importar dar&aacute; comienzo la validaci&oacute;n de la informaci&oacute;n contenida  en el fichero para ver si se corresponde con la estructura empleada por la D.G.C. (Figura 20).</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno4.jpg" alt="4" width="643" height="580" border="0"><br>
Figura 20. Proceso de Validaci&oacute;n</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El progreso de esta validaci&oacute;n y  su resultado final se mostrar&aacute; en el campo <strong>Estado  de la Validaci&oacute;n  del proceso de Importaci&oacute;n</strong>, de manera que podremos conocer el resultado de  esta.</p>
    <div align="center" class="contenidonormal"><img src="./img/FinRetorno5.jpg" alt="5" width="647" height="582" border="0"><br>
      Figura 21. Resultado Validaci&oacute;n
      </p>
    </div>
    <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Si la validaci&oacute;n se ha realizado  con &eacute;xito se habilitar&aacute; el bot&oacute;n <strong>Siguiente</strong> de la ventana de importaci&oacute;n, en caso contrario permanecer&aacute; deshabilitado y se  indicar&aacute; que el fichero no es correcto (Figuras 21 y 22).</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno6.jpg" alt="6" width="647" height="582" border="0"><br>
  Figura 22. Validaci&oacute;n err&oacute;nea</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez que se haya pulsado el  bot&oacute;n <strong>Siguiente</strong> comenzar&aacute; la  importaci&oacute;n de los datos, de manera que se almacenar&aacute;n en la base de datos,  indicando una vez haya finalizado el proceso los resultados de la importaci&oacute;n.  Durante el proceso de importaci&oacute;n aparecer&aacute; en pantalla un reloj indicando el  estado del proceso (Figuras 23 y 24).</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno7.jpg" alt="7" width="400" height="100" border="0"><br>
Figura 23. Progreso inserci&oacute;n</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno8.jpg" alt="8" width="399" height="100" border="0"><br>
Figura 24. Progreso inserci&oacute;n</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Los resultados de la importaci&oacute;n  se mostrar&aacute;n en una nueva ventana en el campo <strong>Resultado de la   Importaci&oacute;n</strong>, indicando las estad&iacute;sticas de la importaci&oacute;n  realizada (Figura 25).</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno9.jpg" alt="9" width="644" height="582" border="0"><br>
Figura 25. Resultado Inserci&oacute;n</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Durante el proceso de la  importaci&oacute;n de los datos, puede que ocurran errores en la inserci&oacute;n o  actualizaci&oacute;n de los datos contenidos en el fichero, estos errores se mostrar&aacute;n  en una ventana de error. Para ver el error que se ha producido con m&aacute;s detalle  habr&aacute; que pulsar sobre el bot&oacute;n <strong>Mostrar  Detalles</strong> de esta ventana de error (Figuras 26 y 27).</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno10.jpg" alt="10" width="506" height="122" border="0"><br>
Figura 26. Error de inserci&oacute;n</p>
<p align="center" class="contenidonormal"><img src="./img/FinRetorno11.jpg" alt="11" width="512" height="322" border="0"><br>
Figura 27. Error inserci&oacute;n. Mostrar Detalles</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para dar por finalizada la  importaci&oacute;n de los datos hay que pulsar en el bot&oacute;n Finalizar de la  herramienta. <br>
  Adem&aacute;s se podr&aacute; cancelar en  cualquier momento el proceso de importaci&oacute;n pulsando sobre el bot&oacute;n <strong>Cancelar</strong>, de manera que se cerrar&aacute; la  ventana de importaci&oacute;n del padr&oacute;n catastral.<br>
  Por &uacute;ltimo podremos volver a la  ventana anterior pulsando en&nbsp; el bot&oacute;n <strong>Anterior</strong>, permitiendo as&iacute; repetir la  tarea de importaci&oacute;n de los datos de la misma manera que se ha indicado.</p>

</body>
</html>
