<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Importacion de la informacion del padron catastral</title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h2 class="cabeceraazuloscuro">Importaci&oacute;n de la informaci&oacute;n del  padr&oacute;n catastral</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta herramienta permite a los  usuarios con permisos importar la informaci&oacute;n del padr&oacute;n catastral. La  importaci&oacute;n se realizar&aacute; a trav&eacute;s de un fichero XML o de texto que contendr&aacute; la  informaci&oacute;n, este fichero ser&aacute; facilitado por catastro y deber&aacute; cumplir la estructura  definida por la D.G.C.  (http://www.catastro.meh.es/esp/colaboradores1.asp#menu4). </p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para acceder a este importador  habr&aacute; que pulsar en la pesta&ntilde;a <strong>Padr&oacute;n  Catastral</strong> dentro de la opci&oacute;n del men&uacute; <strong>Importaci&oacute;n  de Ficheros, </strong>Figura2. Una vez hecho esto aparecer&aacute; la ventana representada  en la Figura  3.</p>
<p align="center"><img src="./img/PadronCatastral1.jpg" alt="1" width="323" height="181" border="0"><br>
  <span class="contenidonormal">Figura 2. Selecci&oacute;n en el men&uacute;</span></p>
<p align="center"><img src="./img/PadronCatastral2.jpg" alt="2" width="642" height="522" border="0"><br>
  <span class="contenidonormal">Figura 3. Importador de la Informaci&oacute;n del padr&oacute;n  catastral</span></p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;A trav&eacute;s de esta ventana se va a  realizar la importaci&oacute;n de los datos. Dentro de <strong>Informaci&oacute;n de la importaci&oacute;n</strong> habr&aacute; que seleccionar el tipo de  fichero a importar (XML o Texto), los datos que se van a importar y se  seleccionar&aacute; el fichero con la informaci&oacute;n; todo esto se realiza a trav&eacute;s de  los campos <strong>Tipo de fichero</strong>, <strong>Datos a Importar</strong> y <strong>Fichero a Importar</strong>, pulsando el bot&oacute;n de este &uacute;ltimo (<img src="./img/PadronCatastral3.gif" alt="3" width="47" height="22" border="0">) se nos abrir&aacute; un explorador de archivos que  nos permitir&aacute; seleccionar el fichero concreto a importar.<br>
  Una vez seleccionado el fichero  que se quiere importar dar&aacute; comienzo la validaci&oacute;n (Figura 4) de la informaci&oacute;n  contenida en el fichero para ver si se corresponde con la estructura empleada  por la D.G.C. El  progreso de esta validaci&oacute;n y su resultado final se mostrar&aacute; en el campo <strong>Estado de la Validaci&oacute;n del proceso  de Importaci&oacute;n</strong>, de manera que podremos conocer el resultado de esta.</p>
  <div align="center"><img src="./img/PadronCatastral4.jpg" alt="4" width="642" height="542" border="0"><br>
    <span class="contenidonormal">Figura 4. Validaci&oacute;n de los datos del  fichero
    </p>
  </span></div>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Si la validaci&oacute;n se ha realizado  de forma correcta, el fichero cumple con la estructura empleada por la D.G.C. entonces se indicar&aacute;  que se ha realizado con &eacute;xito y se habitar&aacute; el bot&oacute;n de <strong>Siguiente</strong> que se encuentra en la ventana (Figura 5). En caso  contrario se indicar&aacute; al usuario que la validaci&oacute;n del fichero no se ha  realizado correctamente y el bot&oacute;n <strong>Siguiente</strong> continuar&aacute; deshabilitado (Figura 6).</p>
    <div align="center" class="contenidonormal"><img src="./img/PadronCatastral5.jpg" alt="5" width="642" height="540" border="0"><br>
      Figura 5. Validaci&oacute;n finalizada  correctamente </div>
<p align="center" class="contenidonormal"><img src="./img/PadronCatastral6.jpg" alt="6" width="642" height="542" border="0"><br>
  Figura 6. Error en la validaci&oacute;n del  fichero</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez que se haya pulsado el  bot&oacute;n Siguiente del panel, comenzar&aacute; la importaci&oacute;n de los datos del padr&oacute;n  catastral, de manera que se almacenar&aacute;n en de forma adecuado en la base de  datos del sistema. Los resultados de la importaci&oacute;n se mostrar&aacute;n por pantalla  una vez haya finalizado este proceso (Figura 7). </p>
<p align="center" class="contenidonormal"><img src="./img/PadronCatastral7.jpg" alt="7" width="642" height="543" border="0"><br>
  Figura 7. Fin de la Importaci&oacute;n</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En el caso en que se produzca  alg&uacute;n error en la inserci&oacute;n o actualizaci&oacute;n de los datos a importar, se  indicar&aacute; al usuario a trav&eacute;s de una ventana de error.<br>
  Para ver el error que se ha  producido con m&aacute;s detalle habr&aacute; que pulsar sobre el bot&oacute;n <strong>Mostrar Detalles</strong> de esta ventana de error (Figuras 8 y 9).</p>
<p align="center" class="contenidonormal"><img src="./img/PadronCatastral8.jpg" alt="8" width="506" height="122" border="0"><br>
Figura 8. Error en la insecci&oacute;n</p>
<p align="center" class="contenidonormal"><img src="./img/PadronCatastral9.jpg" alt="9" width="511" height="321" border="0"><br>
Figura 9. Error de Inserci&oacute;n</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez finalizado el proceso  podremos volver a la ventana anterior pulsando en&nbsp; el bot&oacute;n <strong>Anterior</strong>,  de manera que podremos repetir el proceso, o cerrar la ventana dando por  finalizado el proceso pulsando sobre el bot&oacute;n <strong>Finalizar</strong>.<br>
  Se podr&aacute; cancelar el proceso de  importaci&oacute;n en cualquier momento pulsando sobre el bot&oacute;n <strong>Cancelar</strong>, de manera que se cerrar&aacute; la ventana de importaci&oacute;n del  padr&oacute;n catastral.</p>
</body>
</html>
