<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>1</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<FONT FACE="Verdana, Arial"><STRONG><P>GENERADOR DE INFORMES</STRONG>. </P>
</FONT><FONT FACE="Verdana, Arial" SIZE=3><P>El generador de informes es la herramienta que posibilita la creaci&oacute;n din&aacute;mica de informes a gusto del usuario. Tambi&eacute;n podr&aacute; seleccionar un informe previamente creado.</P>
<P>El generador de informes consta de un asistente de 7 pasos:</P>

<UL>
<LI>Paso 1. Selecci&oacute;n /Creaci&oacute;n de un informe. </LI>
<LI>Paso 2. Caracter&iacute;sticas Generales del Informe. </LI>
<LI>Paso 3. Datos del encabezado del informe. </LI>
<LI>Paso 4. Selecci&oacute;n de Campos en el informe </LI>
<LI>Paso 5. Selecci&oacute;n de Registros </LI>
<LI>Paso 6. Uniones entre tablas. </LI>
<LI>Paso 7. Finalizaci&oacute;n del Informe.</LI></UL>

<STRONG><P>&nbsp;</P>
<P>Selecci&oacute;n / Creaci&oacute;n de Informe</P>
</STRONG><P>Esta primera pantalla del asistente, permitir&aacute; seleccionar un informe creado previamente con el asistente, o bien se podr&aacute; crear un informe nuevo. </P>
</FONT><P><IMG SRC="Image10.jpg" WIDTH=752 HEIGHT=500></P>
<FONT FACE="Verdana, Arial" SIZE=3><P>Para la selecci&oacute;n o creaci&oacute;n de un informe se har&aacute; clic sobre los botones de opci&oacute;n correspondientes:</P>
<P>Haciendo clic sobre <B>Informe Nuevo</B> se pasar&aacute; al siguiente paso del generador de informes.</P>
</FONT><P><IMG SRC="Image11.gif" WIDTH=289 HEIGHT=96></P>
<FONT FACE="Verdana, Arial" SIZE=3><P>Para usar un informe ya creado se har&aacute; clic sobre la otra opci&oacute;n de <B>Selecci&oacute;n del Informe</B>. A continuaci&oacute;n aparecer&aacute;n en el cuadro de lista los ficheros que se encuentran ubicados en el equipo.</P>
<PRE>El nombre de los ficheros se nombra con</PRE>

<UL>
<LI>Nombre del m&oacute;dulo al que pertenece (Planeamiento, Castatro,etc). </LI>
<LI>Nombre del fichero que se le ha dado al crearlo. </LI></UL>

<P>Al hacer clic sobre un fichero, se rellenar&aacute; el <B>T&iacute;tulo del Fichero </B>y la <B>Descripci&oacute;n,</B> para una mejor identificaci&oacute;n por parte del usuario.</P>
<P>Una vez decidido que acci&oacute;n se va a llevar a cabo (creaci&oacute;n o selecci&oacute;n) se har&aacute; clic sobre el bot&oacute;n <B>Siguiente. <IMG SRC="Image12.jpg" WIDTH=90 HEIGHT=24></P></B></FONT></BODY>
</HTML>
