<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Herramientas de edici&oacute;n.&nbsp; Generaci&oacute;n de geometr&iacute;as paralelas</h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta herramienta permite generar geometr&iacute;as paralelas con respecto a un  segmento seleccionado previamente y equidistantes entre s&iacute;. Consta de un &uacute;nico  bot&oacute;n dentro del panel de herramientas de edici&oacute;n <img src="./img/iconoedicion.gif" alt="1" width="24" height="24">, con el siguiente aspecto: <img src="./img/iconoparalelas.gif" alt="2" width="25" height="25"><br>
  &nbsp;<br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El usuario selecciona el elemento de referencia y selecciona la herramienta  &ldquo;Generaci&oacute;n de segmentos y pol&iacute;gonos paralelos&rdquo;.&nbsp; El siguiente paso consiste en seleccionar el  segmente al cual van a ser paralelas las copias de la geometr&iacute;a seleccionada.  Tambi&eacute;n habr&aacute; que introducir la distancia del segmento de referencia a la que  se van a fijar las copias paralelas, esto se har&aacute; a trav&eacute;s de la caja de texto  del panel de las herramientas de edici&oacute;n.</p>
  <div align="center"><img src="./img/ejemploparalelas1.jpg" alt="3" width="586" height="440">  </div>
  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una vez realizados estos dos pasos moveremos el rat&oacute;n en la zona del mapa a  la derecha o izquierda del segmento seleccionado, seg&uacute;n d&oacute;nde quiera el usuario  las copias de las figuras, y podr&aacute; crear una nueva figura cada vez que haga  clic en el mapa. Si se hace doble clic con el rat&oacute;n en el mapa se  deseleccionar&aacute; el segmento tomado como referencia y se podr&aacute; seleccionar otro  segmento distinto.</p>
    <div align="center"><img src="./img/ejemploparalelas2.jpg" alt="4" width="586" height="440">    </div>
    <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cada vez que se cree una nueva entidad se solicitar&aacute; al usuario que  introduzca los atributos por pantalla.<br>
  Para que la herramienta funcione correctamente hay que seleccionar una  &uacute;nica entidad y adem&aacute;s &eacute;sta debe encontrarse en una capa editable, en caso  contrario se mostrar&aacute; un mensaje de aviso en la barra de estado indicando al  usuario lo ocurrido.</p>
  <div align="center"><img src="./img/panelatributosparalelas.jpg" alt="5" width="322" height="344"></div>
</body>
</html>
