<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h3 class="cabecera3azuloscuro">Creaci&oacute;n de una nueva columna de  Base de Datos</h3>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El proceso a seguir para la  creaci&oacute;n de una nueva columna de base de datos es el que se expone a  continuaci&oacute;n:</p>
<ul>
  <li>
    <div align="justify" class="contenidonormal"> 
      <div align="left">Pinchar sobre el bot&oacute;n A&ntilde;adir,  situado en la zona derecha, al lado de la lista de columnas. Se mostrar&aacute; un  cuadro de di&aacute;logo en el que habr&aacute; que introducir los siguientes datos:</div>
    </div>
  </li>
</ul>
<div align="center"><img src="./img/CreacionColumna1.gif" alt="1" width="380" height="400"></div>
<ul>
   <ul>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">Nombre de la columna en la  base de datos</div>
       </div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">Nombre de la columna en el  sistema: Se ir&aacute; rellenando autom&aacute;ticamente a medida que se rellene el nombre en  base de datos. No obstante, es posible darle otro nombre, aunque<strong> a menos que sean s&oacute;lo diferencias entre  may&uacute;sculas y min&uacute;sculas, no habr&aacute; luego forma de relacionarlo con la columna de  base de datos</strong>.</div>
       </div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> Tipo de datos: Se muestra un  desplegable en el que seleccionar el tipo de los datos que se utilizar&aacute;n en la  columna de base de datos: numeric, varchar, date,&hellip;. Se trata de los tipos de  datos que permite la base de datos utilizada.</div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">Tama&ntilde;o: Dependiendo del tipo  de datos seleccionado, se mostrar&aacute; habilitado o no este campo, en el que hay  que introducir el tama&ntilde;o del campo.</div>
       </div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">Precisi&oacute;n: Dependiendo del  tipo de datos seleccionado, se mostrar&aacute; habilitado o no este campo, en el que  hay que introducir la precisi&oacute;n del campo.</div>
       </div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">Valor por defecto: En formato  SQL</div>
       </div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">Comentario</div>
       </div>
     </li>
     <li>
       <div align="justify" class="contenidonormal"> 
         <div align="left">No nulo: Marcar si el campo  no puede tomar valores nulos.</div>
       </div>
     </li>
     <li> 
       <div align="justify" class="contenidonormal">
         <div align="left">&Uacute;nico: Marcar si el campo  tiene que tomar valores &uacute;nicos para cada entrada.<br>
           <br>
         </div>
       </div>
     </li>
  </ul>
   <li>
     <div align="justify" class="contenidonormal">
       <div align="left">Una vez rellenados los  campos, se pulsa Aceptar. Si los campos obligatorios (nombre en base de datos y  tipo) no se han rellenado, se lanza un mensaje de error indic&aacute;ndolo.</div>
     </div>
   </li>
</ul>
 <div align="center"><img src="./img/CreacionColumna2.jpg" alt="2" width="396" height="115"></div>
 <ul>
   <li>
     <div align="justify" class="contenidonormal">
       <div align="left">Si la columna se crea de modo  satisfactorio, se actualiza la lista de columnas de la derecha. En caso  contrario, se muestra un mensaje de error indicando la causa.<br>  
         <br>
       </div>
     </div>
   </li>
   <li>     
     <div align="justify" class="contenidonormal">
       <div align="left"><strong>NOTA</strong>: En caso de no querer generar  columna de sistema asociada a la columna de base de datos, basta con no  introducir un nombre en el campo Nombre en Sistema (o borrar el que se  autocompleta).</div>
     </div>
   </li>
 </ul>
</body>
</html>
