<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h3 class="cabecera3azuloscuro">Creaci&oacute;n de una nueva tabla de Base  de Datos</h3>
<p align="justify" class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La creaci&oacute;n de una nueva tabla en  la base de datos, supondr&aacute; a su vez la generaci&oacute;n autom&aacute;tica de una nueva tabla  de sistema. El proceso a seguir es el que se expone a continuaci&oacute;n:</p>
<ul>
  <li>
    <div align="justify" class="contenidonormal">Pinchar sobre el bot&oacute;n A&ntilde;adir,  situado en la zona inferior izquierda, bajo la lista de tablas.
  
  Se mostrar&aacute; un  cuadro de di&aacute;logo en el que habr&aacute; que introducir el nombre de la tabla y el  tipo de datos que contendr&aacute; (este tipo de datos se utilizar&aacute; b&aacute;sicamente para  la creaci&oacute;n de la tabla de sistema correspondiente), pudiendo tratarse de datos  geom&eacute;tricos o alfanum&eacute;ricos.</div>
  </li>
</ul>
<div align="center"><img src="./img/CreacionTabla1.gif" alt="1" width="350" height="220">
  </p>
</div>
<ul>
  <li>
    <div align="justify" class="contenidonormal">Una vez rellenados los  campos, se pulsa Aceptar. Si los campos no se han rellenado, se lanza un  mensaje de error indic&aacute;ndolo.</div>
  </li>
</ul>
<div align="center"><img src="./img/CreacionTabla2.jpg" alt="2" width="396" height="115">    </div>
    <ul>
      <li>
        <div align="justify" class="contenidonormal"> Si la tabla se crea de modo  satisfactorio, se actualiza la lista de tablas de la izquierda. En caso  contrario, se muestra un mensaje de error. Para ver la causa, se pulsa el bot&oacute;n  Mostrar Detalles, que ampl&iacute;a la informaci&oacute;n, indicando el mensaje de error que <strong>devuelve la base de datos</strong> al intentar  realizar la operaci&oacute;n.</div>
      </li>
    </ul>
    <div align="center"><img src="./img/CreacionTabla3.gif" alt="3" width="512" height="315">
        </p>
    </div>
    <ul>
      <li>
        <div align="justify" class="contenidonormal"><strong>NOTA</strong>: Dado que se entiende que las  tablas de nueva creaci&oacute;n se van a utilizar para la generaci&oacute;n de nuevas capas,  se introducen autom&aacute;ticamente una serie de columnas en base de datos y en  sistema:<br>
          <ul>
            <li>Columna num      &eacute;rica de 8  posiciones, de valores no nulos y &uacute;nicos, llamada id. </li>
            <li> Columna num&eacute;rica de 5  posiciones, de valores no nulos, llamada id_municipio.</li>
            <li> Adem&aacute;s, en caso de haber  creado una tabla geom&eacute;trica, se a&ntilde;adir&aacute; tambi&eacute;n una columna de tipo  public.geometry, llamada GEOMETRY.</li>
          </ul>
        </div>
      </li>
    </ul>
    <div align="center"><img src="./img/CreacionTabla4.gif" alt="4" width="390" height="141"></div>
</body>
</html>
