<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">Pesta&ntilde;a  3: Capas </h1>
<p align="left" class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;La pesta&ntilde;a Capas se utiliza para  realizar procesos de edici&oacute;n sobre las capas de GeoPISTA: creaci&oacute;n de nuevas  capas, y modificaci&oacute;n y borrado de capas existentes. El aspecto de la pantalla  es el que se muestra en la siguiente figura:</p>
    <div align="center"><img src="./img/Pestania3Capas1.jpg" alt="1" width="642" height="409">    </div>
  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se observa que la pantalla est&aacute;  dividida en varias regiones:</p>
    <ul>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">En la zona superior izquierda  aparece la lista de operaciones que se pueden realizar desde esta pantalla:  crear, modificar y eliminar capas. Dependiendo de la selecci&oacute;n que se realice  en este listado, se habilitar&aacute;n unos u otros componentes del resto de la  pantalla </div>
        </div>
      </li>
    </ul>
    <div align="center"><img src="./img/Pestania3Capas2.jpg" alt="2" width="162" height="67"></div>
    <ul>
      <li>
        <div align="justify" class="contenidonormal"> 
          <div align="left">La zona superior central  contiene dos combos que permiten seleccionar la familia de capas o la capa  sobre la que se realizar&aacute; la operaci&oacute;n seleccionada previamente.</div>
        </div>
      </li>
    </ul>
    <div align="center"><img src="./img/Pestania3Capas3.gif" alt="3" width="303" height="69"><br>
      <br>
        <img src="./img/Pestania3Capas4.jpg" alt="4" width="321" height="197">
      </p>
    </div>
    <blockquote>
      <p class="contenidonormal"><strong>NOTA</strong>: Por motivos de seguridad, en  la lista de capas &uacute;nicamente se mostrar&aacute;n las capas que haya creado el usuario,  y no todas las del sistema. </p>
    </blockquote>    
    <ul>
      <li>
        <div align="justify" class="contenidonormal">
          <div align="left">En la zona superior derecha  aparecen dos cuadros de texto en los que se mostrar&aacute; el nombre y el  identificador de la capa sobre la que se realiza la operaci&oacute;n. Tambi&eacute;n se  muestra un desplegable en el que se seleccionar&aacute; el ACL de la capa</div>
        </div>
      </li>
    </ul>
    <div align="center"><img src="./img/Pestania3Capas5.gif" alt="5" width="496" height="83">    </div>
    <blockquote>
      <p class="contenidonormal">Pinchando sobre el bot&oacute;n con un  icono de bandera situado junto al nombre de la capa, aparece una ventana que  permite introducir dicho nombre en los diferentes idiomas dados de alta en el  sistema (en el dominio ADM_LENGUAJE de Administraci&oacute;n).</p>
    </blockquote>
<div align="center"><img src="./img/Pestania3Capas6.jpg" alt="6" width="600" height="500">    </div>
    <ul>
      <li>
        <div align="justify" class="contenidonormal">
          <div align="left">La zona central de la  pantalla se utiliza para editar los atributos que forman parte del esquema de  una capa. </div>
        </div>
      </li>
    </ul>
<div align="center"><img src="./img/Pestania3Capas7.jpg" alt="7" width="642" height="256">    </div>
    <blockquote>
      <p class="contenidonormal">En la parte izquierda se muestra  el listado de todas las columnas, agrupadas por la tabla en la que se  encuentran. En la derecha se muestra una tabla con todos los atributos  incluidos en el esquema de la capa, as&iacute; como sus caracter&iacute;sticas (origen de  datos, nombre del atributo, editable). <br>
        <br>
      A ambos lados de esta tabla se  alinean una serie de botones que permiten la edici&oacute;n de los datos que contiene:</p>
      <ul>
          <li>
            <div align="justify" class="contenidonormal">
              <div align="left"><img src="./img/Pestania3Capas8.gif" alt="8" width="25" height="25">&nbsp;:  Permite a&ntilde;adir un nuevo atributo al esquema de la capa. Para ello previamente  deber&aacute; estar seleccionada una columna de la lista de Tablas de sistema.</div>
            </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal">
            <div align="left"><img src="./img/Pestania3Capas9.gif" alt="10" width="25" height="25">&nbsp;:  Permite eliminar un atributo del esquema de la capa. Para ello previamente  deber&aacute; haber seleccionada una fila de la tabla de Atributos.</div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal">
            <div align="left"><img src="./img/Pestania3Capas10.gif" alt="11" width="25" height="25">&nbsp;y<img src="./img/Pestania3Capas11.gif" alt="13" width="25" height="25"> : Permiten ordenar los atributos del esquema,  de modo que la flecha  <img src="./img/Pestania3Capas10.gif" alt="12" width="25" height="25">&nbsp;permite colocarlo por delante del anterior, y  la flecha <img src="./img/Pestania3Capas11.gif" alt="14" width="25" height="25">&nbsp; lo  colocar&aacute; por detr&aacute;s del siguiente. </div>
          </div>
        </li>
      </ul>
      <div align="justify" class="contenidonormal">
        <div align="left">Debajo de la lista de Atributos  se encuentra una Lista de Claves en la que se especificar&aacute;n las claves externas  a aplicar sobre los distintos atributos del esquema de la capa. <br>
          Estas claves se utilizar&aacute;n a la  hora de generar las consultas SQL que permitir&aacute;n la selecci&oacute;n, inserci&oacute;n,  actualizaci&oacute;n y borrado de las distintas entidades que formen parte de la capa.  A la derecha de la lista aparece un bot&oacute;n <img src="./img/Pestania3Capas12.gif" alt="15" width="25" height="25">&nbsp;que  permite eliminar una clave previamente generada. A la izquierda de la lista  aparece un bot&oacute;n <img src="./img/Pestania3Capas8.gif" alt="9" width="25" height="25">&nbsp; que  permite a&ntilde;adir una nueva clave a la lista, para lo que es necesario que previamente  se hayan seleccionado dos columnas del &aacute;rbol de Tablas del Sistema. </div>
      </div>
    </blockquote>
    <ul>
      <li>
        <div align="justify" class="contenidonormal">
          <div align="left">La zona inferior de la  pantalla contiene los siguientes elementos:</div>
        </div>
      </li>
    </ul>
    <div align="center"><img src="./img/Pestania3Capas13.jpg" alt="16" width="642" height="108"></div>
    <ul>
      <ul>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Dos combos, que permiten  seleccionar el tipo de Base de Datos y el nombre de la consulta SQL sobre la  que se va a realizar la edici&oacute;n.</div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Un cuadro de texto editable,  en el que se mostrar&aacute; la consulta SQL a editar.</div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Un bot&oacute;n Generar SQL, que  permite proponer consultas SQL simples a partir de los datos de la Tabla de Atributos y la Lista de Claves</div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Un bot&oacute;n Recuperar SQL, para  recuperar las consultas SQL previamente almacenadas para la capa en cuesti&oacute;n. </div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Un bot&oacute;n Test, que se utiliza  para probar el funcionamiento de la consulta SQL antes de grabarla, y que s&oacute;lo  se muestra activo en el caso de sentencias de selecci&oacute;n (deshabilitado en el  resto de los casos por motivos de seguridad).<br>
              <br>
            </div>
          </div>
        </li>
      </ul>
      <li>
        <div align="justify" class="contenidonormal">
          <div align="left">En la zona inferior derecha  se muestra una botonera compuesta por los siguientes botones:</div>
        </div>
      </li>
    </ul>
	<div align="center"><img src="./img/Pestania3Capas14.jpg" alt="17" width="128" height="111"></div>
    <ul>
      <ul>
        <li>
          <div align="justify" class="contenidonormal">
            <div align="left">Eliminar: Permite eliminar  una capa previamente seleccionada en el combo de la zona superior.</div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Grabar: Inserta en el sistema  una nueva capa previamente creada mediante la herramienta. Tambi&eacute;n permite la  actualizaci&oacute;n de los cambios realizados sobre una capa ya existente.</div>
          </div>
        </li>
        <li>
          <div align="justify" class="contenidonormal"> 
            <div align="left">Salir: Permite cerrar la  herramienta, previa confirmaci&oacute;n por parte del usuario.</div>
          </div>
        </li>
      </ul>
    </ul>
    <div align="center"><img src="./img/Pestania3Capas15.jpg" alt="18" width="268" height="115">    </div>
</body>
</html>
