<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">
<h1 class="cabeceraazuloscuro">TERMINOLOG&Iacute;A UTILIZADA</h1>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se recoge a continuaci&oacute;n el  conjunto de t&eacute;rminos utilizados durante la redacci&oacute;n del documento, y que  deber&aacute;n ser conocidos para la comprensi&oacute;n del mismo.</p>
<h2 class="cabecera2azuloscuro">Tablas de base de datos</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Son todas aquellas tablas  recogidas en el modelo de datos y que existen f&iacute;sicamente en la base de datos  GeoPISTA. Con los permisos correspondientes, es posible realizar consultas SQL  sobre su contenido. Se pueden visualizar mediante cualquier programa comercial  destinado a tal efecto, tal y como se observa a continuaci&oacute;n (las tablas de  base de datos se muestran recuadradas en rojo:</p>
    <div align="center"><img src="./img/TerminologiaUtilizada1.jpg" alt="1" width="642" height="466">    </div>
    <h2 class="cabecera2azuloscuro">Columnas de base de datos</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Son todas aquellas columnas  existentes en las tablas de base de datos, tambi&eacute;n denominados campos de la  tabla. En la siguiente imagen se muestran a modo de ejemplo las columnas de una  de las tablas de base de datos recuadradas en rojo:</p>
    <div align="center"><img src="./img/TerminologiaUtilizada2.jpg" alt="2" width="642" height="466">
        </p>
    </div>
    <h2 class="cabecera2azuloscuro">Tablas de sistema o &ldquo;tables&rdquo;</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para que los datos de una tabla  de base de datos puedan formar parte de las capas de GeoPISTA, dicha tabla debe  darse de alta como tabla de sistema. El proceso consiste en insertar una nueva  entrada o registro en la tabla <em>public.tables</em> de la base de datos <em>geopista</em>.</p>
<h2 class="cabecera2azuloscuro">Columnas de sistema o &ldquo;columns&rdquo;</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para que la tabla de base de  datos quede completamente registrada en GeoPISTA, tambi&eacute;n es necesario dar de  alta sus columnas o campos en el sistema. El proceso consiste en insertar una  nueva entrada o registro en la tabla <em>public.columns</em> de la base de datos <em>geopista</em>.</p>
<h2 class="cabecera2azuloscuro">Campo personalizable y dominio</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un campo personalizable es  cualquier atributo definido en una capa de informaci&oacute;n que es susceptible de  tener unas propiedades espec&iacute;ficas para adaptarse a normativas concretas. <br>
  <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Un dominio es un conjunto de  c&oacute;digos y descripciones adaptados a un campo personalizable espec&iacute;fico. <br>
  Para comprender mejor lo que  representa un dominio, se recomienda la lectura del documento <em>Manual de usuario - Administraci&oacute;n de  Usuarios y Dominios v1.0.pdf</em>.<br>
  <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cada columna de sistema puede  estar asociada a un dominio, de modo que se fuerza a las aplicaciones GeoPISTA  a utilizar las normas impuestas por el dominio siempre que se realicen  operaciones sobre dicha columna de sistema.</p>
<h2 class="cabecera2azuloscuro">Capa o &ldquo;layer&rdquo;</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se denomina capa a un conjunto de  datos espaciales que contienen entidades de una misma tem&aacute;tica. Toda capa tiene  un esquema, cuyo cometido es indicar los nombres y tipos de los atributos que  deben contener las entidades que forman parte de la capa. <br>
  <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En la siguiente imagen se muestra  la capa Parcelas y su esquema.</p>
  <div align="center"><img src="./img/TerminologiaUtilizada3.jpg" alt="3" width="642" height="466">
      </p>
  </div>
  <h2 class="cabecera2azuloscuro">Atributo</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se trata de cada una de las  entradas del esquema de una capa. Cada uno de estos atributos est&aacute; asociado a  una columna de sistema, que determina el tipo de dato que contendr&aacute;.</p>
<h2 class="cabecera2azuloscuro">Categor&iacute;a de capas o &ldquo;layerfamily&rdquo;</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Es un conjunto de capas o <em>layers</em> relacionadas por una tem&aacute;tica  com&uacute;n. El concepto de <em>layerfamily</em> es  el que se utiliza en el GIS de GeoPISTA para cargar las capas en un mapa, de  modo que una capa tiene que estar asociada por lo menos a una familia de capas.  Dentro de una familia de capas, la posici&oacute;n de cada una de las capas indica el  orden de pintado de las mismas, de modo que la capa que est&eacute; en una posici&oacute;n  quedar&aacute; cubierta por todas las anteriores a ella.<br>
  <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Una capa que no forma parte de  ninguna familia de capas no podr&aacute; ser cargada en el GIS, si bien seguir&aacute;  existiendo y podr&aacute; ser asociada posteriormente a una o m&aacute;s familias de capas. <br>
  <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Del mismo modo, el borrado de una  familia de capas no implica el borrado de sus capas asociadas, teniendo en  cuenta, adem&aacute;s, que una capa puede formar parte de varias familias de capas a  la vez. </p>
<h2 class="cabecera2azuloscuro">Mapa</h2>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Se trata de una representaci&oacute;n  bidimensional del espacio a una escala determinada. Los mapas est&aacute;n formados  por familias de capas, cada una de las cuales contiene una o varias capas en  las que se recoge la informaci&oacute;n (geogr&aacute;fica y f&iacute;sica) de las entidades que  contiene. <br>
  <br>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En la siguiente imagen se muestra  un mapa formado por varias familias de capas, cada una de las cuales contiene  una serie de capas:</p>
  <div align="center"><img src="./img/TerminologiaUtilizada4.jpg" alt="4" width="642" height="466">
      </p>
    <br clear="all">
  </div>
</body>
</html>
