<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title></title>
<link href="../css/contents.css" rel="stylesheet" type="text/css" />
</head>

<body bgcolor="#FFFFFF">

<h1 class="cabeceraazuloscuro" >Herramientas de edici&oacute;n.  Tratamiento de simetr&iacute;as</h1>
<p align="center"><img src="./img/ejemplosimetria1.jpg" alt="1" width="541" height="356" /></p>
<p class="contenidonormal">
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Esta herramienta permite la generaci&oacute;n de elementos sim&eacute;tricos a partir de  l&iacute;neas simples o puntos, que se utilizar&aacute;n como ejes de simetr&iacute;a. Consta de un  &uacute;nico bot&oacute;n dentro del panel de herramientas de edici&oacute;n <img src="./img/iconoedicion.gif" alt="2" width="24" height="24" />, con el siguiente aspecto: <img src="./img/iconosimetria.gif" alt="3" width="24" height="20" /><br />
Esta opci&oacute;n estar&aacute; accesible para todos los  usuarios del editor GIS.</p>
<p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;El usuario dibuja en una capa auxiliar la l&iacute;nea o el punto que desea  utilizar como eje de simetr&iacute;a. El usuario selecciona las entidades de las que  desea obtener las simetr&iacute;as. Posteriormente, selecciona la herramienta &ldquo;Tratado  de Simetr&iacute;as&rdquo;.<br />
  El sistema genera las entidades sim&eacute;tricas a las seleccionadas respecto al  eje pintado, y solicita la inserci&oacute;n de los atributos necesarios.</p>
 <p align="center"><img src="./img/panelatributossimetria.jpg" alt="4" width="441" height="464" /></p>
  <p class="contenidonormal">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Si se desea deshacer la operaci&oacute;n se podr&aacute; hacer pulsando el icono Deshacer <img src="./img/iconodeshacer.gif" alt="5" width="24" height="24" />. De esta manera cada vez que pulsemos sobre  este icono se ir&aacute;n eliminando una a una las distintas simetr&iacute;as que se hayan  realizado.</p>
  <div align="center"><img src="./img/ejemplosimetria2.jpg" alt="6" width="574" height="431" /><br />
</div>
  <p class="contenidonormal"> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Para que la herramienta funcione correctamente y sea capaza de obtener la  simetr&iacute;a esperada, habr&aacute; que seleccionar antes de presionar sobre el bot&oacute;n de  la herramienta una &uacute;nica feature o entidad, adem&aacute;s &eacute;sta tendr&aacute; que ser o bien  un &uacute;nico punto o una l&iacute;nea formada por dos puntos. Otra condici&oacute;n necesaria  para esta herramienta es que la capa del mapa donde se encuentra la feature sobre  la que queremos realizar la simetr&iacute;a debe ser editable. En caso contrario se  mostrar&aacute; un mensaje de aviso indicando la causa del mismo.</p>
<div align="center"><img src="./img/ejemplosimetriaaviso.jpg" alt="7" width="574" height="431" />  </div>
</body>
</html>
