<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Propuesta Técnica WEB Silvanus</TITLE>
<META NAME="subject" CONTENT="WEB de Gestión Forestal Sostenible y Certificación Forestal">
<META NAME="keywords" CONTENT="Sostenibilidad, Certificación, Forestal, WEB, ASP, Gestión Sostenible">
</HEAD>
<BODY TEXT="#000000" LINK="#0000ff" VLINK="#800080">

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Interfaz Principal</P>
</B></U><P>&nbsp;</P>
<P>La interfaz principal del editor de LocalGIS consta de una ventana desde la cual tenemos acceso a las distintas funcionalidades de dos maneras distintas: </P>
<P><IMG SRC="Image119.jpg" WIDTH=460 HEIGHT=334></P>

<UL>
<LI>A trav&eacute;s del men&uacute; de opciones</LI>
<LI>A trav&eacute;s de la barra de herramientas</LI></UL>

<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Nuevo Proyecto </P>
</B></U><P>Para crear un nuevo proyecto en el Editor de LocalGIS vaya a la opci&oacute;n &quot;Archivo/Nuevo Proyecto&quot;. Una vez hecho esto se crear&aacute; la ventana de trabajo para el nuevo proyecto donde se podr&aacute; cargar la informaci&oacute;n.</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="31%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image120.jpg" WIDTH=169 HEIGHT=214></FONT></TD>
<TD WIDTH="69%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image121.jpg" WIDTH=387 HEIGHT=216></FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P><IMG SRC="Image122.jpg" WIDTH=235 HEIGHT=154></P>
<P>Ya podemos empezar a trabajar. Para ello cargamos un fichero que se mostrar&aacute; como una nueva capa una vez que se cargue. Sit&uacute;ese en la ventana de trabajo y sobre la carpeta LocalGIS con el bot&oacute;n derecho del rat&oacute;n haga clic. Se mostrar&aacute; un men&uacute; emergente o contextual con una serie de opciones.</P>
<I><P>Nota : Use el bot&oacute;n derecho del rat&oacute;n siempre que desee mostrar las opciones de forma r&aacute;pida.</P>
</I><P>Una vez hecho esto, elegimos la opci&oacute;n denominada &quot;Cargar Fichero&quot;. A continuaci&oacute;n elegimos como tipo de fichero &quot;ESRI Shapefile&quot;, ya que vamos a cargar un fichero con la extensi&oacute;n .shp, uno de los formatos m&aacute;s habituales. </P>
<P><IMG SRC="Image123.jpg" WIDTH=592 HEIGHT=480></P>
<I><P>&nbsp;</P>
<P>&nbsp;</P>
</I><P>En nuestro caso, elegimos el fichero alumbrado.shp y pulsamos &quot;Aceptar&quot;. Veremos, en pocos segundos que la capa se carga en el mapa. Vemos en el panel lateral que existe un item nuevo denominado &quot;alumbrado&quot;. Este nombre proviene del nombre del fichero cargado, pero puede ser cambiado por cualquier otro con el que nos sintamos m&aacute;s c&oacute;modos a la hora de trabajar.</P>
<P><IMG SRC="Image124.jpg" WIDTH=155 HEIGHT=42></P>
<P>&nbsp;</P>
<P>El resultado final deber&iacute;a ser similar a este:</P>
<P><IMG SRC="Image125.jpg" WIDTH=618 HEIGHT=344></P>
<P>El panel superior izquierdo contiene las capas cargadas clasificadas en distintas categor&iacute;as. En el panel inferior izquierdo aparecen las capas cargadas con la posibilidad de poder cambiar el orden entre las capas arrastrando unas capas encima o debajo de las otras. El panel derecho contiene la representaci&oacute;n geom&eacute;trica de las capas correspondientes.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Guardar un Proyecto</P>
</B></U><P>Para guardar un proyecto tenemos utilice la opci&oacute;n &quot;Archivo/Guardar Proyecto&quot; o bien &quot;Archivo/Guardar Proyecto como ...&quot; en el caso de que desee asignar un nombre nuevo al proyecto. En nuestro ejemplo, hemos utilizado &quot;Proyecto01&quot; y pulsamos &quot;Guardar&quot;. Este nombre ser&aacute; el que se utilice en el futuro para cargar nuestro proyecto.</P></FONT>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="32%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image126.jpg" WIDTH=169 HEIGHT=214></FONT></TD>
<TD WIDTH="68%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image127.jpg" WIDTH=370 HEIGHT=226></FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Abrir un Proyecto</P>
</B></U><P>Para abrir un proyecto debemos dirigirnos a &quot;Archivo/Abrir Proyecto&quot;. Tras pulsar en dicha opci&oacute;n se abrir&aacute; un cuadro de di&aacute;logo que nos permitir&aacute; navegar por el disco para cargar el proyecto deseado. </P></FONT>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="38%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image128.jpg" WIDTH=167 HEIGHT=211></FONT></TD>
<TD WIDTH="62%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image129.jpg" WIDTH=344 HEIGHT=223></FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Abrir y Guardar Mapa</P>
</B></U><P><IMG SRC="Image130.jpg" WIDTH=32 HEIGHT=30></P>
<P>El Editor de LocalGIS permite cargar unos proyectos ya preconfigurados en funci&oacute;n de nuestras necesidades como pueden ser Planeamiento, Informaci&oacute;n de Referencia, Catastro o Patrimonio. Estos proyectos reciben el nombre de Mapas. Dichos mapas pueden estar almacenados tanto en local como en la Base de Datos. En realidad, podemos crear un proyecto nuevo, a&ntilde;adir las capas necesarias y guardar toda esa configuraci&oacute;n constituyendo un mapa.</P>
<P><IMG SRC="Image131.jpg" WIDTH=169 HEIGHT=214></P>
<P>Para abrir un mapa, hemos de ir a la opci&oacute;n &quot;Archivo/Abrir Mapa&quot; o bien pulsar sobre su icono. Una vez que pulsemos dicha opci&oacute;n, se nos pedir&aacute; que introduzcamos nuestro login y password. Introduzca el login y password suministrados y pulse Aceptar. De esta forma acceder&aacute; tanto a los mapas locales como a los almacenados en la base de datos y ya estar&aacute; identificado como usuario en todo el resto de operaciones de aqu&iacute; en adelante. En caso de que pulse cancelar no ser&aacute; identificado por el sistema y no tendr&aacute; acceso ni a la informaci&oacute;n de la Base de Datos ni podr&aacute; realizar opraciones que requieran almacenar datos en la Base de Datos. En el primer caso, al ser validado, entrar&aacute; el modo denominado <I>&quot;conectado&quot; </I>y en el segundo caso <I>&quot;desconectado&quot;</P>
<P><IMG SRC="Image132.jpg" WIDTH=247 HEIGHT=177></P>
</I><P>Si todo ha ido correctamente, nos aparecer&aacute; un panel en el cual podremos elegir el mapa que deseamos cargar. Todos los mapas aparecer&aacute;n con los siguientes datos:</P>
<P>T&iacute;tulo del mapa</P>
<P>Fecha de alta</P>
<P>Estado: Base de Datos o Local</P>
<P>Thumbnail : Imagen en miniatura de la vista del mapa que nos puede ayudar a tomar la decisi&oacute;n de qu&eacute; mapa cargar.</P>
<P><IMG SRC="Image133.jpg" WIDTH=258 HEIGHT=258></P>
<P>&nbsp;</P>
<P>A continuaci&oacute;n tendremos cargado el mapa en el Editor. En nuestro caso, elegimos cargar el mapa denominado &quot;Mapa de Catastro&quot;. El resultado deber&iacute;a ser similar a &eacute;ste: </P>
<P><IMG SRC="Image134.jpg" WIDTH=619 HEIGHT=345></P>
<P>&nbsp;</P>
<P><IMG SRC="Image135.jpg" WIDTH=32 HEIGHT=30></P>
<P>Para &quot;Guardar Mapa&quot; podemos ir a &quot;Archivo / Guardar Mapa&quot; o bien pulsar sobre el icono de Guardar Mapa. Si el mapa que hemos abierto con anterioridad, usando la opci&oacute;n de Abrir Mapa, era un Mapa Local se sobreescribir&aacute; la informaci&oacute;n de mapa en el disco duro; en cambio si el mapa era un mapa procedente de la Base de Datos la informaci&oacute;n de mapa se guardar&aacute; en la Base de Datos.</P>
<P>Tenga en cuenta que este proceso puede tardar unos segundos por lo que el editor pudiera parecer que est&aacute; bloqueado cuando en realidad no lo est&aacute; ya que se encuentra procesando la informaci&oacute;n para poder almacenarla.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>A&ntilde;adir una Capa</P>
</B></U><P>Para a&ntilde;adir una capa deberemos tener cargado un proyecto o un mapa. Para ello la forma m&aacute;s habitual consiste en situarse sobre la carpeta,&quot;Catastro&quot;, por ejemplo, en la que vamos a insertar la nueva capa. De esta forma haremos que la nueva capa pertenezca a la familia de las capas de Catastro. Situ&eacute;se en la carpeta de Catastro y haga clic con el rat&oacute;n sobre dicha carpeta. A continuaci&oacute;n aparecer&aacute; el men&uacute; contextual en el que deberemos elegir A&ntilde;adir Nueva Capa. </P>
<P><IMG SRC="Image136.jpg" WIDTH=264 HEIGHT=190></P>
<I><P>Nota: Tambi&eacute;n se crear&aacute; una nueva capa al cargar un fichero, a&ntilde;adir una consulta WMS o cargar capas de LocalGIS.</P>
<P>&nbsp;</P>
</I><P>7</P>
<P>&nbsp;</P>
<P><IMG SRC="Image137.jpg" WIDTH=208 HEIGHT=155></P>
<P>Haciendo doble clic en el nombre de la capa podremos establecer el nombre que deseemos. As&iacute; el resultado final deber&iacute;a ser similar a &eacute;ste (observe que las herramientas de Edici&oacute;n se activan de forma autom&aacute;tica al a&ntilde;adir una nueva capa) : </P>
<P><IMG SRC="Image138.jpg" WIDTH=618 HEIGHT=345></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Operaciones de Zoom</P>
</B></U><P>Una de las operaciones b&aacute;sicas que podemos realizar sobre un mapa es un &quot;zoom&quot;. Un zoom consiste en acercarse o alejarse del mapa visualizado de forma escalada. Esto quiere decir, que tanto si nos acercamos como si nos alejamos veremos con total nitidez y sin deformaci&oacute;n alguna mapa. La operaci&oacute;n de acercamiento se denomina habitualmente &quot;zoom m&aacute;s&quot; y la de alejamiento &quot;zoom menos&quot;. </P>
<P><IMG SRC="Image139.jpg" WIDTH=30 HEIGHT=31></P>
<P>Para realizar un &quot;zoom m&aacute;s&quot; elegimos la herramienta de zoom (ver figura anterior) y, a continuaci&oacute;n, tenemos la opci&oacute;n de pulsar directamente sobre el mapa. Esta acci&oacute;n provocar&aacute; un acercamiento al mapa seg&uacute;n el llamado factor de zoom del Editor de LocalGIS. Otra posibilidad consiste en, seleccionada esta herramienta, dibujar un cuadro sobre la regi&oacute;n hacia la cual deseemos acercarnos. Siempre utilizando el bot&oacute;n izquierdo del rat&oacute;n.</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="40%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image140.gif" WIDTH=239 HEIGHT=133></FONT></TD>
<TD WIDTH="15%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&gt;&gt;&gt;&gt;&gt;&gt;</FONT></TD>
<TD WIDTH="46%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image141.jpg" WIDTH=245 HEIGHT=136></FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>Para realizar un &quot;zoom menos&quot;, pulsamos sobre el mapa con el bot&oacute;n derecho del rat&oacute;n, el efecto ser&aacute; el contrario al de &quot;zoom m&aacute;s&quot;.</P>
<P>Otra posibilidad para realizar &quot;zoom m&aacute;s&quot; y &quot;zoom menos&quot; es utilizar la barra de escala situada en la parte superior .Desplazando el cursor de la barra hacia la derecha nos alejamos del mapa y si lo hacemos a la izquierda nos acercamos.</P>
<P><IMG SRC="Image142.jpg" WIDTH=190 HEIGHT=29></P>

<B><U><P>Zoom Adelante y Atr&aacute;s</P>
</B></U><P><IMG SRC="Image143.jpg" WIDTH=62 HEIGHT=29></P>
<P>El Editor de LocalGIS guarda todos los zooms que realice durante una sesi&oacute;n, entiendiendo por sesi&oacute;n el tiempo que pasa desde que vd. abre un mapa hasta que, finalmente, lo cierra. En ese periodo de tiempo puede realizar las operaciones de zoom que desee, ya que gracias al &quot;zoom adelante&quot; y el &quot;zoom atr&aacute;s&quot; podr&aacute; regresar a la vista deseada en cualquier momento. Pulse cuantas veces sea necesario en el zoom adelante para avanzar en el hist&oacute;rico de vistas y pulse en el zoom atr&aacute;s cuantas veces sea necesario para retroceder en el hist&oacute;rico de vistas. No se preocupe por pulsar demasiadas veces, en el momento en que se encuentre al inicio o al final de dicho hist&oacute;rico los iconos de &quot;zoom adelante&quot; y &quot;zoom atr&aacute;s&quot; se deshabilitar&aacute;n</P>

<B><U><P>DEsplazamientos por el mapa</P>
</B></U><P><IMG SRC="Image144.jpg" WIDTH=31 HEIGHT=31></P>
<P>El Editor de LocalGIS provee una herramienta para poder desplazarse por el mapa. Esta herramienta nos permite ajustar la vista actual sobre aquellos puntos de inter&eacute;s que deseemos sin reajustar la escala de visualizaci&oacute;n.</P>
<P>Para utilizar dicha herramienta haremos clic sobre ella para posteriormente hacer clic sobre el mapa y sin soltar arrastrar la imagen del mapa en la direcci&oacute;n que deseemos.</P>

<B><U><P>Seleccionar Features</P>
</B></U><P><IMG SRC="Image145.jpg" WIDTH=30 HEIGHT=30></P>
<P>Una determinada capa, por ejemplo, parcelas, se compone de una serie de entidades cuyo conjunto constituyen la capa en s&iacute;. Cada una de estas entidades recibe el nombre de &quot;features&quot;. En determinados momentos, nos puede ser &uacute;til seleccionar una determinada feature o un conjunto de ellas para poder operar. Esta operaci&oacute;n la podemos realizar mediante la herramienta de Selecci&oacute;n.</P>
<P>Para seleccionar una feature basta hacer clic sobre la herramienta de Selecci&oacute;n y, a continuaci&oacute;n, hacer clic sobre la feature deseada. Esto har&aacute; que dicha feature cambie el aspecto de su borde al color predeterminado de selecci&oacute;n y que aparezcan remarcados cada uno de sus v&eacute;rtices a fin de resaltar dicha feature sobre el resto.</P>
<P><IMG SRC="Image146.jpg" WIDTH=289 HEIGHT=240></P>
<P>Podemos seleccionar m&uacute;ltiples features de dos formas distintas </P>
<P>1) Teniendo seleccionada la herramienta de Selecci&oacute;n y manteniendo la tecla SHIFT podemos hacer clic en diferentes features de forma individual.</P>
<P><IMG SRC="Image147.jpg" WIDTH=320 HEIGHT=251></P>
<P>2) La segunda posibilidad es realizar un cuadro de selecci&oacute;n ( al igual que se hace para el &quot;zoom m&aacute;s&quot;) sobre las features que deseamos seleccionar. El resultado deber&iacute;a ser similar a &eacute;ste:</P>
<P><IMG SRC="Image148.jpg" WIDTH=435 HEIGHT=340></P>

<B><U><P>Zoom a la selecci&oacute;n</P>
</B></U><P><IMG SRC="Image149.jpg" WIDTH=31 HEIGHT=30></P>
<P>Una vez que hemos seleccionado un grupo de features de una capa, mediante la herramienta de selecci&oacute;n, podemos reajustar la vista actual del mapa para que &eacute;sta se ajuste sobre el grupo de features. As&iacute; usando la herramienta de zoom a la selecci&oacute;n deber&iacute;amos obtener un resultado similar a &eacute;ste:</P>
<P><IMG SRC="Image150.jpg" WIDTH=618 HEIGHT=316></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Punto de Informaci&oacute;n</P>
</B></U><P><IMG SRC="Image151.jpg" WIDTH=31 HEIGHT=29></P>
<P>La herramienta Punto de Informaci&oacute;n se encuentra situada en la barra de herramientas de la parte superior. Tambi&eacute;n se activa cuando desplegamos el men&uacute; contextual de una feature que tengamos seleccionada.</P>
<P><IMG SRC="Image152.jpg" WIDTH=416 HEIGHT=394></P>
<P>En el primer caso, hemos de pulsar sobre el icono del punto de Informaci&oacute;n, para a continuaci&oacute;n , sobre el mapa, hacer clic o bien dibujar un recuadro para mostrar los atributos de la feature/s sobre la que hemos pulsado o bien quedan encuadradas por el rectangulo que hayamos dibujado.</P>
<P><IMG SRC="Image153.jpg" WIDTH=499 HEIGHT=298></P>
<P><IMG SRC="Image154.jpg" WIDTH=500 HEIGHT=300></P>

<B><U><P>Medir</P>
</B></U><P><IMG SRC="Image155.jpg" WIDTH=32 HEIGHT=29></P>
<P>La herramienta de Medici&oacute;n nos permite realizar operaciones de medici&oacute;n sobre el mapa.</P>
<P><IMG SRC="Image156.jpg" WIDTH=267 HEIGHT=266></P>
<P><IMG SRC="Image157.jpg" WIDTH=87 HEIGHT=20></P>
<P>Para utilizarla hemos de hacer clic en su icono, y posteriormente dibujar la forma del objeto que queramos medir. Para ello, iremos haciendo clic en cada uno de los v&eacute;rtices del objeto que deseemos medir. En el ejemplo, puede ver la medici&oacute;n del per&iacute;metro de una parcela. Observe que la figura a medir se va dibujando en un tono distinto para indicarle en todo momento qu&eacute; es lo que est&aacute; midiendo. Tenga en cuenta que este tipo de operaci&oacute;n al ser una operaci&oacute;n manual comporta un cierto factor de error, no en la medici&oacute;n del objeto dibujado pero s&iacute; en su ajuste a lo que realmente se quiere medir. Por ello cuanta mayor precisi&oacute;n necesite, deber&aacute; emplear m&aacute;s v&eacute;rtices con el fin de ajustarse mejor a la realidad.</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Hacer y Deshacer</P>
</B></U><P><IMG SRC="Image158.jpg" WIDTH=64 HEIGHT=29></P>
<P>Ha llegado el momento de deshacer las opraciones que hubi&eacute;ramos realizado hasta el momento ya que nos hemos equivocado ¿qu&eacute; hacer?. El Editor de LocalGIS provee dos herramientas a modo de hist&oacute;rico que nos permiten ir hacia adelante o hacia atr&aacute;s en el hist&oacute;rico de opraciones geom&eacute;tricas que hayamos realizado. Esto nos permite realizar cuantas veces queramos una determinada operaci&oacute;n y deshacerla otras tantas si no estamos conformes con el resultado.</P>
<P>&nbsp;</P>
<P>As&iacute; por ejemplo es posible realizar la siguiente secuencia e ir hacia adelante y hacia atr&aacute;s cuantas veces deseemos:</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="33%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image159.jpg" WIDTH=199 HEIGHT=100></FONT></TD>
<TD WIDTH="33%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image160.jpg" WIDTH=200 HEIGHT=102></FONT></TD>
<TD WIDTH="33%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image161.jpg" WIDTH=200 HEIGHT=100></FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Configurar Opciones y Preferencias</P>
</B></U><P>Desde el men&uacute; &quot;Editar / Opciones&quot; podemos activar el cuadro de di&aacute;logo de Opciones del Editor de LocalGIS. Esto nos permitir&aacute; configurar determinadas cualidades del editor como puede ser el aspecto visual, mostrar o no rejillas de ayuda en los mapas, configurar el tama&ntilde;o de letra de los men&uacute;s y otras m&aacute;s.</P>
<P><IMG SRC="Image162.jpg" WIDTH=188 HEIGHT=243></P>
<B><P>Ajuste / Rejilla</P>
</B><P>En este grupo de opciones podemos variar los par&aacute;metros de ajuste como la tolerancia que se tendr&aacute; con respecto al cursor. Esto nos puede afectar en operaciones de tipo selecci&oacute;n y/o modificaci&oacute;n de geometr&iacute;a.</P>
<P>En cuanto a la rejilla podemos establecer si se muestra o no una rejilla que nos sirva de gu&iacute;a para realizar las diferentes operaciones sobre el mapa. La rejilla puede ser de puntos o l&iacute;neas</P>
</FONT>
<TABLE CELLSPACING=0 BORDER=0 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="50%" VALIGN="TOP" ROWSPAN=2 HEIGHT=252>
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image163.jpg" WIDTH=304 HEIGHT=305></FONT></TD>
<TD WIDTH="50%" VALIGN="TOP" HEIGHT=252>
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image164.jpg" WIDTH=303 HEIGHT=228></FONT></TD>
</TR>
<TR><TD WIDTH="50%" VALIGN="TOP" HEIGHT=80>
<FONT FACE="Verdana" SIZE=3><P>Mapa usando una rejilla</FONT></TD>
</TR>
</TABLE>

<B><FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P>Skins &oacute; Temas Visuales</P>
</B><P>Este grupo de opciones le permite elegir el aspecto visual del editor en cuanto a men&uacute;s, cuadros de di&aacute;logo, paneles y dem&aacute;s componentes gr&aacute;ficos de la aplicaci&oacute;n.</P>
<P><IMG SRC="Image165.jpg" WIDTH=354 HEIGHT=359></P>
<B><P>Ver / Editar</P>
</B><P>Esta opci&oacute;n permite que decida si admite editar geometr&iacute;as incorrectas o no.</P>
<P><IMG SRC="Image166.jpg" WIDTH=354 HEIGHT=359></P>
</FONT><FONT FACE="Arial"><H5>&nbsp;</H5>
<H5>&nbsp;</H5>
<H5>Ajustar a V&eacute;rtices</H5>
</FONT><FONT FACE="Verdana" SIZE=3><P>Esta opci&oacute;n le permite decidir si acepatar el insertar al menos un v&eacute;rtice si no hay en el segmento. </P>
<P><IMG SRC="Image167.jpg" WIDTH=354 HEIGHT=359></P>
<P>&nbsp;</P>
<B><P>&nbsp;</P>
<P>Preferencias de Usuario</P>
</B><P>Este grupo de opciones le permite decidir el tipo de letra de los men&uacute;s, su tama&ntilde;o y estilo de &eacute;stos. Tambi&eacute;n le permite indicar cu&aacute;l ser&aacute; el color utilizado para la selecci&oacute;n de elementos y elegir el icono de la aplicaci&oacute;n. Cualquier cambio en este grupo de opciones requiere reiniciar la aplicaci&oacute;n.</P>
<P>&nbsp;</P>
<P><IMG SRC="Image168.jpg" WIDTH=354 HEIGHT=359></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Estilos SLD</P>
</B></U><P>El estandar SLD define una serie de reglas de pintado que se pueden aplicar sobre los mapas. Antes de aplicar los estilos SLD, tenga en cuenta que el orden de aplicaci&oacute;n de las diferentes reglas de pintado que vaya a crear es : <I>Texto, puntos, l&iacute;neas y pol&iacute;gonos</I>.</P>
<P><IMG SRC="Image169.jpg" WIDTH=32 HEIGHT=30></P>
<P>Pulse en el icono en forma de Paleta para abrir el panel de los Estilos SLD. Una vez que se muestre el panel mencionado, ver&aacute; aquellos estilos que se encuentren disponible en disponibles en funci&oacute;n de la capa que, actualmente, se encuentre seleccionada.</P>
<P><IMG SRC="Image170.jpg" WIDTH=315 HEIGHT=230></P>
<P>Por defecto siempre existe un estilo, en este caso, denominado &quot;default.&quot; Este es el estilo que se est&aacute; aplicando a la capa seleccionada.</P>
<P>&nbsp;</P>
<P>Para crear un estilo pulse en &quot;Nuevo&quot;.</P>
<P><IMG SRC="Image171.jpg" WIDTH=442 HEIGHT=373></P>
<P>A continuaci&oacute;n, defina el rango de escalas entre las cuales ser&aacute; visible el estilo que va a crear. Para ello pulse sobre el bot&oacute;n &quot;Nuevo&quot; que se encuentra junto al recuadro de Rangos de Escala. Deber&iacute;a aparecerle un cuadro como el siguiente:</P>
<P><IMG SRC="Image172.jpg" WIDTH=392 HEIGHT=98></P>
<P>Una vez creado el rango de escala, podemos pasar a definir las reglas de pintado teniendo en cuenta el orden de preferencia que se ha indicado anteriormente. Para una capa de pol&iacute;gono, pulasmos en Reglas de Pintado / Pol&iacute;gonos y pulsamos en Nuevo.</P>
<P><IMG SRC="Image173.jpg" WIDTH=392 HEIGHT=373></P>
<P>Cambiamos el nombre de la regla de pintado por el que deseemos y elegimos las opciones de colores, redondez en nodos y v&eacute;rtices. Con esto ya hemos creado la regla de pintado, pulsamos Aceptar. A continuaci&oacute;n, veremos que nuestra regla de pintado aparece en el cuadro de di&aacute;logo. </P>
<P><IMG SRC="Image174.jpg" WIDTH=307 HEIGHT=203></P>
<P>&nbsp;</P>
<P>Seleccionamos el estilo que hemos creado &quot;Estilo nuevo&quot; y pulsamos aceptar de nuevo. El resultado deber&iacute;a ser similar a &eacute;ste:</P>
<P>&nbsp;</P>
<P><IMG SRC="Image175.jpg" WIDTH=623 HEIGHT=354></P>

<B><U><P>Impresi&oacute;n de Mapas y series de Mapas</P>
</B></U><P><IMG SRC="Image176.jpg" WIDTH=63 HEIGHT=31></P>
<P>Una vez que tengamos cargado un mapa, hayamos hecho las operaciones que correspondan sobre el mismo, puede ser interesante imprimirlo. Ante dicha acci&oacute;n se nos plantean dos opciones imprimir el mapa completo o bien imprimir una serie utilizando como patr&oacute;n de corte una determinada capa.</P>
<P>Pulsando en el icono de la Impresora o en el Plotter podemos imprimir el mapa con su leyenda, elegir la escala de visualizaci&oacute;n, y elegir si se imprimen algunos componentes como la leyenda. Antes de imprimir tendremos la posibilidad, en la vista previa, de poder visualizar como quedar&aacute; el mapa y decidir si queremos imprimir o no. La diferencia entre ambos procesos es que en el caso de Imprimir Series de un mapa, se nos pedir&aacute; la capa gu&iacute;a que servir&aacute; para cortar el mapa. </P>
<I><P>Nota : utilice una capa de tipo rejilla para poder crear Series de Mapas</P>
</I><P>El proceso se ve a continuaci&oacute;n:</P>
</FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image177.jpg" WIDTH=304 HEIGHT=247></FONT></TD>
<TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image178.jpg" WIDTH=304 HEIGHT=247></FONT></TD>
</TR>
<TR><TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image179.jpg" WIDTH=288 HEIGHT=214></FONT></TD>
<TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image180.jpg" WIDTH=303 HEIGHT=212></FONT></TD>
</TR>
<TR><TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image181.jpg" WIDTH=223 HEIGHT=253></FONT></TD>
<TD WIDTH="50%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image182.jpg" WIDTH=302 HEIGHT=254></FONT></TD>
</TR>
</TABLE>

<B><U><FONT FACE="Verdana" SIZE=3><P>Ver / Editar Atributos de las Entidades Seleccionadas</P>
</B></U><P><IMG SRC="Image183.jpg" WIDTH=33 HEIGHT=30></P>
<P>Para poder ver los atributos un grupo de entidades y editarlos si lo desea, debe seleccionar unas features de una determinada capa y a continuaci&oacute;n pulsar el icono. En nuestro caso hemos seleccionado un grupo de parcelas.</P>
<P><IMG SRC="Image184.jpg" WIDTH=619 HEIGHT=345></P>
<P>Tenga en cuenta que al seleccionar puede hacerlo sobre features o entidades de diferentes capas, pero le ser&aacute; m&aacute;s c&oacute;modo si selecciona entidades de la misma capa. En ambos casos, el Editor de LocalGIS est&aacute; preparado para mostrar los atributos independientemente de la capa de que procedan. </P>
<P>Para cada una, esto es importante, de las entidades seleccionadas deber&iacute;a ver un panel similar a &eacute;ste:</P>
<P><IMG SRC="Image185.jpg" WIDTH=617 HEIGHT=426></P>
<P>Visualice los datos y ed&iacute;telos si fuera necesario. Los cambios quedan guardados en su sesi&oacute;n en cuanto pulse &quot;Aceptar&quot;. Cuando pulse &quot;Aceptar&quot; pasar&aacute; al siguiente panel que le mostrar&aacute; el esquema de la entidad siguiente con los valores de sus atributos. Cuando ya no desee editar / visualizar m&aacute;s entidades pulse &quot;Cancelar&quot;. El editor le preguntar&aacute; si desea editar m&aacute;s entidades, diga que no.</P>
<P><IMG SRC="Image186.jpg" WIDTH=268 HEIGHT=115></P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<B><U><P>Marcas de Posici&oacute;n</P>
</B></U><P><IMG SRC="Image187.jpg" WIDTH=32 HEIGHT=31></P>
<P>Una marca de posici&oacute;n es una vista guardada. A la hora de trabajar nos puede ser interesante en determinado momento guardar la vista o encuadre de la zona del mapa en la que estamos trabajando para poder regresar, posteriormente, a esta. </P>
<P>Cuando desee establecer una marca de posici&oacute;n, pulse en el icono de la barra de tareas que tiene forma de chincheta. A continuaci&oacute;n, se le mostrar&aacute; un panel en el cual podr&aacute; visuaizar las marcas que hubiera anteriormente.</P>
<P><IMG SRC="Image188.jpg" WIDTH=470 HEIGHT=230></P>
<P>Escriba el nombre que desee, en nuestro caso hemos puesto Vista 5. Observe que ten&iacute;amos 4 vistas o marcas almacenadas. Pulse &quot;Nuevo&quot; y se guardar&aacute; la marca de la posici&oacute;n actual.</P>
<P>Si desea situarse en alguna de las vistas, selecci&oacute;nela y pulse el bot&oacute;n &quot;Ir a&quot;. EL mapa se situar&aacute; inmediatamente en la vista seleccionada. Si desea eliminar alguna marca, selecci&oacute;nela y pulse el bot&oacute;n de Eliminar. </P>
<P><IMG SRC="Image189.jpg" WIDTH=390 HEIGHT=335></P>

<B><U><P>B&uacute;squeda por Atributos</P>
</B></U><P>Las features o entidades de cada capa est&aacute;n compuestas de una parte geom&eacute;trica y una parte alfanum&eacute;rica. Esta parte alfanum&eacute;rica es la que denominamos atributos. as&iacute; pues, un atributo puede ser el &aacute;rea de una parcela (en el caso de que la capa &quot;parcelas&quot; est&eacute; cargada), puede ser el per&iacute;metro de dicha parcela, el tipo, la categor&iacute;a ... etc.</P>
<P>El Editor de LocalGIS permite realizar la b&uacute;squeda de features o entidades cuyos atributos cumplan unas condiciones.</P>
<P><IMG SRC="Image190.jpg" WIDTH=551 HEIGHT=250></P>
<P>En nuestro ejemplo se buscar&aacute; sobre la capa parcelas por el campo o atributo ID_Parcela aquellas features cuyo ID_Parcela sea igual a 102.</P>
<P>El resultado deber&iacute;a ser similar a &eacute;ste:</P>
<P><IMG SRC="Image191.jpg" WIDTH=422 HEIGHT=377></P>

<B><U><P>b&Uacute;SQUEDA DE N&Uacute;MEROS DE POLIC&Iacute;A</P>
</B></U><P><IMG SRC="Image192.jpg" WIDTH=31 HEIGHT=31></P>
<P>La b&uacute;squeda de n&uacute;meros de polic&iacute;a se activa cuando la capa n&uacute;meros de polic&iacute;a se encuentra cargada. Por ejemplo, cargue el mapa denominado &quot;Mapa de Catastro&quot; y pulse sobre el icono de B&uacute;squeda N&uacute;meros de Polic&iacute;a. Vamos a buscar la C/ Venezuela 10.</P>
<P><IMG SRC="Image193.jpg" WIDTH=409 HEIGHT=173></P>
<P>Introducimos los datos y pulsamos &quot;Aceptar&quot;. Se nos mostrar&aacute; un panel con las features que cumplan la condici&oacute;n introducida. El resultado debiera ser similar a &eacute;ste:</P>
<P>&nbsp;</P>
<P><IMG SRC="Image194.jpg" WIDTH=453 HEIGHT=309></P>

<B><U><P>Modificar las Propiedades de un Mapa</P>
</B></U><P>Otro aspecto importante a la hora de trabajar con una gran cantidad de mapas es poder tener metainformaci&oacute;n o metadatos sobre los mismos. Esto es importante, ya que seg&uacute;n va pasando el tiempo podemos no acordarnos de si un mapa era tal, o bien para ir controlando las diferentes versiones que vamos realizando de los mismos, ya que pudi&eacute;ramos en un futuro ver c&oacute;mo han ido evolucionando.</P>
<P><IMG SRC="Image195.jpg" WIDTH=31 HEIGHT=29></P>
<P>Esta operaci&oacute;n la podemos realizar pulsando el icono de propiedades de mapa. Haciendo clic, se nos abrir&aacute; un panel donde podremos modificar aspectos tales como: el nombre del mapa, la descripci&oacute;n, las unidades de visualizaci&oacute;n, la escala de referencia y el sistema de proyecci&oacute;n utilizado.</P>
<P>&nbsp;</P>
<P><IMG SRC="Image196.jpg" WIDTH=401 HEIGHT=250></P>

<B><U><P>Cambiar el Esquema de varias Features o Entidades de forma simult&aacute;nea.</P>
</B></U><P>Hacer cambios en los atributos de un esquema de una determinada entidad o feature puede ser sencillo, sin embargo cuando el problema se presenta para un grupo considerable de las mismas, esta tarea puede resultar bastante tediosa si el procedimiento pasa por realizar dichos cambios de forma individual para cada feature. Es por ello, que el Editor de LocalGIS nos facilita una herramienta para ello.</P>
<P><IMG SRC="Image183.jpg" WIDTH=33 HEIGHT=30></P>
<P>Pulsando en el icono de &quot;cambiar esquema de features simult&aacute;neamente&quot;, nos aparecer&aacute; un cuadro de di&aacute;logo desde el cual podremos realizar los cambios. Esta opci&oacute;n, hemos de decir, se activa solamente para features seleccionadas de una misma capa, ya que, aunque es posible realizar una selecci&oacute;n de entidades procedentes de distintas capas, el realizar cambios multiples en distintas features se consider&oacute; que es m&aacute;s efectivo realizar dichos cambios para entidades de una misma capa.</P>
<P>En resumen, seleccionemos entidades de una misma capa, da igual que la capa seleccionada sea otra (como vemos en el ejemplo) siempre que las features seleccionadas pertenezcan a la misma capa. Pulsamos en el icono de &quot;cambiar esquema de las features seleccionadas&quot;.</P>
<P><IMG SRC="Image184.jpg" WIDTH=619 HEIGHT=345></P>
<P>A continuaci&oacute;n, una vez pulsado el icono, se nos muestra el cuadro de di&aacute;logo mencionado. Rellenaremos solamente aquellos atributos en los cuales deseemos realizar un cambio de forma m&uacute;ltiple. Tenga en cuenta que esta operaci&oacute;n conlleva un cierto riesgo ya que estamos editando de forma simult&aacute;nea numerosas entidades. No se preocupe, siempre podr&aacute; volver atr&aacute;s o salir sin grabar los cambios en el mapa.</P>
<P><IMG SRC="Image185.jpg" WIDTH=617 HEIGHT=426></P>

</FONT><B><U><FONT FACE="Verdana"><P ALIGN="JUSTIFY">Fusionar Features o Entidades</P>
</B></U></FONT><FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image197.jpg" WIDTH=32 HEIGHT=30></P>
<P ALIGN="JUSTIFY">Una operaci&oacute;n habitual, al trabajar con diferentes equipos trabajo o bien por el evoluci&oacute;n misma de la cartograf&iacute;a a lo largo del tiempo, es la fusi&oacute;n de entidades. Esto es, nos puede interesar fusionar dos geometr&iacute;as (principalmente, l&iacute;neas y pol&iacute;gonos) en una sola. Para ello, seleccionamos, al menos, dos features lindantes; ya que es necesario para realizar la fusi&oacute;n que tengan al menos un punto com&uacute;n para no generar geometr&iacute;as no v&aacute;lidas. Dichas features han de ser pertenecientes a la misma capa o bien a capas distintas.</P>
<P>&nbsp;</P>
<P><IMG SRC="Image198.jpg" WIDTH=621 HEIGHT=351></P>
<P>A continuaci&oacute;n, indicamos la capa sobre la cual se va a realizar la fusi&oacute;n. Esto es por un motivo: a veces puede ser interesante seleccionar features vecinas pero pertenecientes a distintas capas y fusionarlas en una nueva entidad sobre otra capa.</P>
<P><IMG SRC="Image199.jpg" WIDTH=576 HEIGHT=189></P>

<B><U><P>Segregar Features o Entidades</P>
</B></U><P>Al igual que nos puede interesar en un determinado momento fusionar dos entidades en una sola, nos puede interesar la operaci&oacute;n contraria, es decir, dividir una determinada feature en dos o m&aacute;s.</P>
<P><IMG SRC="Image200.jpg" WIDTH=32 HEIGHT=29></P>
<P>Para ello dibujamos, por ejemplo, sobre una nueva capa dos features lindantes que nos servir&aacute;n de patr&oacute;n de corte para la feature que deseamos segregar.</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=632>
<TR><TD WIDTH="41%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image201.jpg" WIDTH=176 HEIGHT=41></FONT></TD>
<TD WIDTH="59%" VALIGN="TOP">
<FONT FACE="Verdana" SIZE=3><P><IMG SRC="Image202.jpg" WIDTH=302 HEIGHT=187></FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana" SIZE=3><P>&nbsp;</P>
<P><IMG SRC="Image200.jpg" WIDTH=32 HEIGHT=29></P>
<P>Una vez hecho esto, seleccionamos las features de la nueva capa m&aacute;s aquella que deseamos dividir. </P>
<P><IMG SRC="Image203.jpg" WIDTH=489 HEIGHT=293></P>
<P>&nbsp;</P>
<P>A podemos pulsar sobre el icono de segregar features para proceder a la divisi&oacute;n. Recordar que debemos rellenar los atributos de las dos nuevas features generadas, en este caso. El resultado final deber&iacute;a ser similar a &eacute;ste:</P>
<P><IMG SRC="Image204.jpg" WIDTH=507 HEIGHT=263></P>
</FONT></BODY>
</HTML>
