<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Selección de Registros</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P>Selecci&oacute;n de Registros</P>
</B></U></FONT><FONT FACE="Verdana" SIZE=3><P>El siguiente paso es especificar la selecci&oacute;n de registros que queramos que aparezcan en el informe, es decir, establecer criterios de b&uacute;squeda.</P>
</FONT><P><IMG SRC="Image47.jpg" WIDTH=819 HEIGHT=576></P>
<FONT FACE="Verdana" SIZE=3><P>A diferencia del punto anterior, puede que no se establezca ning&uacute;n criterio de b&uacute;squeda, por tanto aparecer&aacute;n todos los datos correspondientes a los campos que se han introducido en la secci&oacute;n anterior.</P>
<P>A igual que en la secci&oacute;n anterior, los criterios de b&uacute;squeda podr&aacute;n ser :</P>

<UL>
<B><LI>No Espaciales</B>: Campos normales de la base de datos (mayor, menor, distinto, etc.)</LI>
<B><LI>Espaciales</B>: Operaciones espaciales con los campos geometr&iacute;a de las capas (contenido, a una distancia de , etc. )</LI></UL>

<P>&nbsp;</P>
<P>Al seleccionar del cuadro combinado de <B>Tablas </B>se rellenar&aacute;n de forma autom&aacute;tica los campos en el cuadro combinado de <B>campos.</P>
</B><P>Hay que tener en cuenta que en el cuadro combinado de <B>Tablas</B> s&oacute;lo aparecer&aacute;n las tablas que en el paso 2 del asistente se hayan seleccionado.</P>
<P>Las operaciones que se dejan realizar para los campos no espaciales son:</P>

<UL>
<LI>Mayor</LI>
<LI>Menor</LI>
<LI>Distinto</LI>
<LI>Entre</LI>
<LI>Igual</LI>
<LI>Menor o igual que</LI>
<LI>Mayor o igual que</LI></UL>

<P>Las operaciones que se realizar&aacute;n sobre los campos espaciales son:</P>

<UL>
<LI>Intersecciona</LI>
<LI>Contenido</LI>
<LI>A una distancia de</LI></UL>

<P>Para a&ntilde;adir un criterio de b&uacute;squeda al informe se pulsar&aacute; el bot&oacute;n <IMG SRC="Image42.jpg" WIDTH=49 HEIGHT=27>e ir&aacute;n apareciendo en la tabla un nombre de criterio nombrado como <B>C</B>x (donde x es un n&uacute;mero) y a su lado el criterio, como se muestra en la figura siguiente:</P>
</FONT><P><IMG SRC="Image47.jpg" WIDTH=814 HEIGHT=569></P>
<FONT FACE="Verdana" SIZE=3><P>Si se desea eliminar una criterio de b&uacute;squeda se deber&aacute; seleccionar la fila de la tabla a borrar y pulsar el bot&oacute;n <IMG SRC="Image44.jpg" WIDTH=36 HEIGHT=31></P>
<P>A medida que se van generando los criterios de b&uacute;squeda se ir&aacute; rellenando tambi&eacute;n el siguiente cuadro combinado</P>
</FONT><P><IMG SRC="Image48.gif" WIDTH=816 HEIGHT=100></P>
<FONT FACE="Verdana" SIZE=3><P>En esta secci&oacute;n se introducir&aacute; una expresi&oacute;n l&oacute;gica de dos formas:</P>

<UL>
<LI>Tecleando la expresi&oacute;n, teniendo en cuenta que el nombre a colocar ser&aacute; el que est&aacute; en el cuadro combinado, correspondiente a la notaci&oacute;n Cx anteriormente descrita</LI></UL>
<DIR>

<P>En este caso las uniones entre condiciones ser&aacute;n mediante las palabras AND , OR (y L&oacute;gico, O L&oacute;gico).</P>
<P>La Negaci&oacute;n se realizar&aacute; mediante la palabra NOT.</P></DIR>


<UL>
<LI>Mediante la casilla de verificaci&oacute;n, el cuadro combinado de condiciones y las uniones (Y o O).</LI></UL>

<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P>
<P>&nbsp;</P></FONT></BODY>
</HTML>
