<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>PROCESOS DE IMPORTACIÓN</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana, Arial"><P><A NAME="_Toc85525910">Procesos de importaci&oacute;n.</A></P><DIR>

</B></U><P>Se describir&aacute;n los procesos de importaci&oacute;n de los datos de Informaci&oacute;n de referencia.</P>
<P>Se distinguen dos procesos de importaci&oacute;n:</P></DIR>

<OL TYPE="a">

<LI>El proceso en el que se usaran tanto ficheros gr&aacute;ficos como ficheros de texto. Se mostrar&aacute; una salida gr&aacute;fica, visualizando los mapas a importar, y una salida de texto indicando los registros procesados.</LI>
<LI>El proceso que s&oacute;lo usa ficheros de texto. En este caso no existir&aacute; una visualizaci&oacute;n gr&aacute;fica del resultado, tan s&oacute;lo se mostrar&aacute; un resumen de los registros procesados.</LI></OL>

<B><U><P><A NAME="_Toc85525911">Importar Datos de la D.G. de Catastro</A></P>
</B></U><P>Mediante esta opci&oacute;n se importar&aacute;n los datos de las parcelas provenientes de un fichero en formato <B>shapefile (.shp)</B>, dentro de la base de datos en la tabla parcelas.</P>
<P>Se lanzar&aacute; un asistente con dos pasos:</P>

<UL>
<LI>En el primero se pedir&aacute; unos datos generales </LI>
<LI>En el segundo se visualizar&aacute;n los datos</LI></UL>

<P>&nbsp;</P>
<B><P><A NAME="_Toc85525912">Paso 1. Selecci&oacute;n del fichero.</A></P>
</B></FONT><P><IMG SRC="Image18.jpg" WIDTH=817 HEIGHT=576></P>
<FONT FACE="Verdana, Arial"><P>Se rellenar&aacute;n los siguientes campos:</P>
<B><P>Fuente</B>:&#9;Donde proviene la informaci&oacute;n</P>
<B><P>Organismo</B>:Organismo que posee la informaci&oacute;n</P>
<B><P>Persona</B>:&#9;Persona que realiza la importaci&oacute;n</P>
<B><P>Fecha</B>:&#9;Fecha de la importaci&oacute;n</P>
<B><P>Tipo</B> :&#9;&#9;Tipo del fichero</P>
<P>Se deber&aacute; seleccionar el fichero de parcelas, que indica el cuadro combinado, haciendo clic sobre el bot&oacute;n <IMG SRC="Image19.gif" WIDTH=35 HEIGHT=25></P>
<P>Aparecer&aacute; un cuadro de di&aacute;logo en el que se buscar&aacute; el fichero por el equipo del cliente.</P>
</FONT><P><IMG SRC="Image20.jpg" WIDTH=814 HEIGHT=527></P>
<FONT FACE="Verdana, Arial"><P>Se pulsar&aacute; el bot&oacute;n abrir y se comenzar&aacute; un proceso de validaci&oacute;n del fichero. Las validaciones que se preveen afectan a:</P>

<UL>
<B><LI>Campos</B>. Nombres de los campos que se esperan que vengan en el fichero </LI>
<B><LI>Valores</B>. Se evaluar&aacute;n los valores de los campos principales, revisando especialmente valores nulos y valores que no sean del tipo adecuado.</LI></UL>

<P>Una vez comprobadas las verificaciones se mostrar&aacute;n un mensaje donde se indicar&aacute; si el fichero ha sido correcto y se puede continuar con el siguiente paso, o bien si se el proceso de validaci&oacute;n ha encontrado errores y no dejar&aacute; continuar.</P>
<P>Si el fichero es correcto saldr&aacute;: </P>
</FONT><P><IMG SRC="Image18.jpg" WIDTH=816 HEIGHT=575></P></BODY>
</HTML>
