<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>Gestor de Eventos y Avisos de Gestión del Suelo</TITLE>
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">

<B><U><FONT FACE="Verdana"><P>Gestor de Eventos y Avisos de Gesti&oacute;n del Suelo</P>
</B></U><P>El gestor de eventos y avisos de gesti&oacute;n del duelo, permite realizar al usuario el seguimiento temporal de los &Aacute;mbitos de Gesti&oacute;n del Suelo.</P>
<P>Esta pantalla se encuentra habilitada para cualquier perfil de usuario. El apartado "Datos del &Aacute;mbito" aparece en gris y no puede ser modificado por el usuario.</P>
<P>Para que aparezcan estos datos, debe de haberse importado previamente ambitos de gesti&oacute;n del suelo, de lo contrario no aparecer&aacute; nada.</P>
<P>Esta pantalla se organiza en cuatro apartados principales:</P>

<UL>
<LI>Un localizador gr&aacute;fico y un localizador alfanum&eacute;rico en forma de combo. Permitir&aacute; al usuario la selecci&oacute;n del &aacute;mbito de actuaci&oacute;n. </LI>
<LI>Un apartado de datos gen&eacute;ricos del &aacute;mbito que se encuentra deshabilitado para la edici&oacute;n. </LI>
<LI>Hist&oacute;rico de Eventos. Gestor que permite introducir, modificar o eliminar eventos relacionados con la gesti&oacute;n del suelo. </LI>
<LI>Avisos. Gestor de Avisos que permite introducir, eliminar o modificar Avisos sobre &Aacute;mbitos concretos de Gesti&oacute;n del Suelo.</LI></UL>

</FONT><P><IMG SRC="Image97.gif" WIDTH=564 HEIGHT=436></P>
<FONT FACE="Verdana"><P>Para insertar, modificar y eliminar eventos o avisos, es necesario tener los permisos necesarios. En caso contrario, estos botones aparecer&aacute;n desactivados.</P>
<P>Para ver los datos de los &aacute;mbitos de gesti&oacute;n, hay que seleccionarlos con la herramienta "Selecci&oacute;n": <IMG SRC="Image92.gif" WIDTH=28 HEIGHT=28>.</P>
<P>Una vez seleccionado el &aacute;mbito de gesti&oacute;n, se rellenar&aacute;n autom&aacute;ticamente los datos relativos a ese &aacute;mbito. Para ver los eventos y avisos de gesti&oacute;n, el usuario tendr&aacute; que seleccionar sobre la fecha que desee consultar.</P>
<P>&nbsp;</P>
<B><U><P><A NAME="_Toc85601974">Barra de Herramientas</A></P>
</B></U><P>La barra de herramientas del Gestor de Eventos, tiene 5 herramientas:</P>
<P>&nbsp;</P></FONT>
<TABLE BORDER CELLSPACING=1 CELLPADDING=4 WIDTH=565>
<TR><TD WIDTH="14%" VALIGN="TOP" HEIGHT=41>
<P><IMG SRC="Image98.gif" WIDTH=27 HEIGHT=27></TD>
<TD WIDTH="86%" VALIGN="TOP" HEIGHT=41>
<FONT FACE="Verdana"><P>Muestra el mapa completo</FONT></TD>
</TR>
<TR><TD WIDTH="14%" VALIGN="TOP" HEIGHT=41>
<P><IMG SRC="Image99.gif" WIDTH=25 HEIGHT=27></TD>
<TD WIDTH="86%" VALIGN="TOP" HEIGHT=41>
<FONT FACE="Verdana"><P>Punto de referencia para acercar</FONT></TD>
</TR>
<TR><TD WIDTH="14%" VALIGN="TOP" HEIGHT=41>
<P><IMG SRC="Image90.gif" WIDTH=28 HEIGHT=27></TD>
<TD WIDTH="86%" VALIGN="TOP" HEIGHT=41>
<FONT FACE="Verdana"><P>Desplazamiento por el mapa</FONT></TD>
</TR>
<TR><TD WIDTH="14%" VALIGN="TOP" HEIGHT=41>
<P><IMG SRC="Image100.gif" WIDTH=27 HEIGHT=28></TD>
<TD WIDTH="86%" VALIGN="TOP" HEIGHT=41>
<FONT FACE="Verdana"><P>Distancia entre los puntos que el usuario marque sobre el mapa</FONT></TD>
</TR>
<TR><TD WIDTH="14%" VALIGN="TOP" HEIGHT=41>
<P><IMG SRC="Image92.gif" WIDTH=28 HEIGHT=28></TD>
<TD WIDTH="86%" VALIGN="TOP" HEIGHT=41>
<FONT FACE="Verdana"><P>Selecci&oacute;n sobre el mapa</FONT></TD>
</TR>
</TABLE>

<FONT FACE="Verdana"><P>&nbsp;</P>
</FONT></BODY>
</HTML>
